[{"Date":"3.1.2013","Show":"Show 379","Description":"Jim and Greg kick off the Sound Opinions World Tour with a musical voyage to Sweden. DJ Stefan Wermelin is our guide through Swedish Pop history from ABBA to Robyn.","Guests":"Stefan Wermelin","ShowNotes":"1 For as long as we can recall, the music industry story has been a sad one. But perhaps, there’s a happy ending? It has taken 13 years, but music revenues are finally up, albeit by 3%. But that’s still cause for celebration. Looks like digital music has been a big boost to the record biz, with its contribution to 30% of sales. And who was selling? Well, no surprises here: Adele and Carly Rae Jepsen are the reigning queens.\n\n2 This week the Center for Copyright Information, which includes members of the RIAA, MPA and many ISP’s, will begin to alert users engaged in illegal activity like piracy. The system hopes to be educational, rather than punitive. So, after “six strikes,” or alerts, a user may lose internet speed or be forced to watch videos about piracy. Will this be enough to curb a commonplace practice? We dunno, but here’s a video to tell you more. And please note the exits to your right and left.\n\n3 Jim and Greg have always insisted that rock ‘n’ roll belongs to the world. In our new series, the Sound Opinions World Tour, they prove it by zeroing in on countries that’ve made big contributions to global rock and pop. Their first stop is the largest exporter of music per capita in the world: Sweden. Swedish DJ and public radio host Stefan Wermelin is our guide through the country’s musical history. Stefan explains that in the ‘50s and ‘60s, Sweden was a pop music backwater. Musicians churned out cut-rate covers of American and English hits. The ‘60s hippie “Progg” movement injected some originality and artistic ambition into Swedish music, but things didn’t really change until ABBA hit it big with “Waterloo.” According to Stefan, ABBA set the template for Swedish success. The band created big hits by co-opting the best bits of global pop music and stitching them together with meticulous production. That tradition of pastiche continues today with Swedish producers like Max Martin, the man behind a hundred-and-one Billboard Top Ten hits (Britney Spears’ “…Baby One More Time” and Kelly Clarkson’s “Since U Been Gone” among them). But today, Sweden’s also experiencing an indie renaissance in genres as varied as death metal, dance music, and Americana. Decades after ABBA, artists like The Knife,Lykke Li, Robyn, Opeth, and First Aid Kit are staging a second Swedish invasion.\n\nCheck out our Sweden Playlist, inspired by this week’s show, on Spotify.\n\n4 After his solo project The Eraser, Radiohead frontman Thom Yorke went out on tour with a group that could only be described as “super”: Red Hot Chili Peppers’ Flea on bass, Radiohead producer Nigel Godrich on programming, Joey Waronker on drums and Mauro Refosco on percussion. The collaboration worked so well that the group has released an album under the name Atoms for Peace. Greg was impressed with how The Eraser really found its identity live, and he has high hopes AMOK will do the same. But on record, the songs are not as strong as the production, so he can only say Burn It. In terms of his unique voice, Thom Yorke has finally won Jim over. He gets the robotic and alien nature of the voice the electronic musicianship and the dystopian lyrics and says Buy It.\n\n5 Miles Davis has been on Greg’s mind lately, and his revolutionary string of early ‘70s albums(including Bitches Brew, Live-Evil, and On the Corner) have been fixtures on Greg’s turntable for weeks. Miles’ rock and funk explorations can be partially credited to (or blamed on, depending on your point of view) his then wife, Betty Davis. She put out her own series of great records after their divorce. For his Desert Island Jukebox pick this week, Greg turns to the first song on Betty Davis’ 1973 self-titled debut, “If I’m in Luck I Might Get Picked Up.” Betty put together an incredible band of Santana and Sly Stone sidemen (including Larry Graham on bass!), and wrote parts for them that contained more than enough grit and grime to complement her raspy blues roar and bawdy lyrics. Even Prince personally told Greg that he uses this song as a frequent source of inspiration! ","PullQuote":"","Recurringsegments":"Greg's DIJ","AlbumReviews":"Atoms for Peace - Amok","FeaturedSongs":"Carly Rae Jepsen, “Call Me Maybe,” Kiss, 604\/Schoolboy\/Interscope, 2012\nThe B-52s, “Roam,” Cosmic Thing. Reprise, 1989\nRobyn, “Hang With Me,” Body Talk Pt. 2, Konichiwa, 2010\nOpeth, “The Drapery Falls,” Blackwater Park, Music for Nations, 2001\nBill Haley and His Comets, “Rock Around the Clock,” Rock Around the Clock, Decca, 1955\nBursell Twins, “Route 66,” single, 1956\nHoola Bandoola Band, “Vem Kan Man Lita På,” Vem Kan Man Lita På, MNW, 1972\nEbba Grön, “Staten Och Kapitalet” single, Mistlur, 1980\nBjörn Ulvaeus & Benny Andersson, “Hej Gamle Man,” single, Polar, 1970\nABBA, “Waterloo,” Waterloo, Polar, 1974\nABBA, “Mamma Mia,” ABBA, Polar, 1975\nLykke Li, “Get Some,” Wounded Rhymes, LL, 2011\nABBA, “Fernando,” single, Polar, 1976\nBlue Swede, “Hooked on a Feeling,” Hooked on a Feeling, EMI, 1974\nAce of Base, “The Sign,” The Sign, Warner Bros., 1993\nBackstreet Boys, “Everybody (Backstreet’s Back),” Backstreet’s Back, Jive, 1997\nIn Flames, “Deliver Us,” Sounds of a Playground Fading, Century Media\/Razzia, 2011\nSahara Hotnights, “Alright Alright) Here’s My Fist Where’s the Fight),” Jennie Bomb, RCA, 2001\nGhost, “Elizabeth,” Opus Eponymous, Rise Above, 2011\nFirst Aid Kit, “Emmylou,” The Lion’s Roar, Redeye, 2012\nAndi Almqvist, “Low Dive Jenny,” Red Room Stories, Rootsy, 2007\nLittle Dragon, “Ritual Union,” Ritual Union, Peacefrog, 2011\nAtoms for Peace, “Default,” Amok, XL Recordings, 2013\nAtoms for Peace, “Judge, Jury and Executioner,” Amok, XL Recordings, 2013\nBetty Davis, “If I’m in Luck I Might Get Picked Up,” Betty Davis, Just Sunshine Records, 1973\nTommy Tutone, “867-5309\/Jenny,” Tommy Tutone 2, Columbia, 1981\nDead Sweaters, “Dangerous,” Dead Sweaters, self-released, 2012\nFuture Islands, “The Great Fire,” On the Water, Thrill Jockey, 2011\nJimmy Cliff, “You Can Get It If You Really Want,” The Harder They Come, Island, 1972\nBob Marley, “400 Years,” Soul Rebels, Trojan, 1970","Audio":"http:\/\/audio.soundopinions.org\/streams\/2013\/03\/so_20130301.m3u","MainImage":"http:\/\/www.soundopinions.org\/images\/2013\/swedishrock.jpg","FlickrPhotoSet":"","Videos":""},{"Date":"2.22.2013","Show":"Show 378","Description":"Call it Sound Opinions' antidote to the Grammys: Jim and Greg play tracks they think deserve wider notice during our latest Buried Treasures episode.","Guests":"","ShowNotes":"1 Lady Gaga has cancelled her “Born This Way” tour due to a hip injury. (You can see her wheeling around Chicago post-surgery). Millions of little monsters will be deprived of 22 national shows. And the Gaga camp might be out $35 million. With all the dancing and acrobatics, it’s surprising more pop artists aren’t wiped out by injuries…gives Jim and Greg a new appreciation for Tina Turner.\n\n2 In other concert news, Paul McCartney will be headlining the Bonnaroo Festival in Tennessee.  He’ll be joined by Mumford and Sons and Tom Petty, but also Wu-Tang Clan and Nas—some surprising additions to the traditionally roots and jam festival. Concertgoers will also be excited to hear about the Firefly Festival’s plans for its second year, including the Yeah Yeah Yeahs and Kendrick Lamar. Here in Chicago, the Pitchfork Festival has booked Bjork and in perplexing move, controversial hometown boy R. Kelly.\n\n3 During the last part of the news segment, Jim and Greg bid farewell to songwriter and producer Shadow Morton. He was instrumental in bringing the Shangri-Las to fame with hits like “Leader of the Pack” and “Remember” that compressed teen angst dramas into three-minute pop operas. And Shadow later worked with Janis Ian and The New York Dolls.\n\n4 Just think of it as Sound Opinions’ antidote to the Grammys: Buried Treasures. During this installment, Jim and Greg dig deep to bring you some hidden musical gems they think deserve wider notice. Here are their gems:\n\nJim\nFoxygen, We Are the 21st Century Ambassadors of Peace & Magic\nSpookeasy, Faux Show\nBig Dipper, Big Dipper\nLow Cut Connie, Call Me Sylvia\n\nGreg\nIndians, Somewhere Else  \nDawn Richard, Goldenheart  \nFollakzoid, II\nGap Dream, Gap Dream\n\n5 Nick Cave is a modern renaissance man—novelist, poet, actor, playwriting, and of course rocker. Now, with his band The Bad Seeds, he’s released the ensemble’s 15th album called Push the Sky Away. Greg is impressed with the scope of the lyrics—from the God Particle to Hannah Montana. This record is more introspective and more minimalist, and Greg says Buy It. Jim is disappointed and wishes the tracks were less monotonous and less quiet. He misses the punk explosion and can only recommend you Burn It.\n\n                                                                ","PullQuote":"","Recurringsegments":"Buried Treasures","AlbumReviews":"Nick Cave and the Bad Seeds - Push the Sky Away","FeaturedSongs":"Lady Gaga, “Born This Way,” Born This Way, Interscope, 2011\nDave Grohl, Paul McCartney, Krist Novoselic, and Pat Smear, “Cut Me Some Slack,” Sound City: Real to Reel, RCA, 2013\nNew York Dolls, “Who Are the Mystery Girls?,” Too Much Too Soon, Mercury, 1974\nThe Shangri-Las, “Remember (Walking in the Sand),” single, Red Bird, 1964\nIndians, “Magic Kids,” Somewhere Else, 4AD, 2013\nFoxygen, “San Francisco,” We Are the 21st Century Ambassadors of Peace & Magic, Jagjaguwar, 2013\nKlaus Schulze, “Shadowlights,” Shadowlands, Synthetic Symphony, 2013\nDawn Richard, “Gleaux,” Goldenheart, Our Dawn, 2013\nSpookeasy, “Bo Deadly,” Faux Show, self-released, 2013\nFollakzoid, “9,” II, Sacred Bones, 2013\nBig Dipper, “Robert Pollard,” Big Dipper Crashes on the Platinum Planet, Almost Ready Records, 2012\nGonjasufi, “The Blame,” MU.ZZ.LE, Warp, 2012\nLow Cut Connie, “Say Yes,” Call Me Sylvia, Low Cut Connie LLC, 2012\nGap Dream, “Generator,” Ali Baba, Suicide Squeeze, 2012\nNick Cave and the Bad Seeds, “Finishing Jubilee Street,” Push the Sky Away, Bad Seed Ltd., 2013\nNick Cave and the Bad Seeds, “Higgs Boson Blues,” Push the Sky Away, Bad Seed Ltd., 2013\nJJ Doom, “Guv’nor,” Key to the Kuffs, Lex Records, 2012\nSoul Asylum, “Somebody to Shove,” Grave Dancers Union, Columbia, 1992\nSam Cooke, “Bring it on Home to Me,” single, RCA, 1962\nCarla Thomas, “I’ll Bring it on Home to You,” single, Atlantic, 1962\nRod Stewart, “You’re in My Heart (The Final Acclaim),” Foot Loose & Fancy Free, Warner Bros., 1977\nBob Marley & The Wailers, “Exodus,” Exodus, Island, 1977\nBurning Spear, “ African Teacher,” Hail H.I.M., Tuff Gong, 1980","Audio":"http:\/\/audio.soundopinions.org\/streams\/2013\/02\/so_20130222.m3u","MainImage":"http:\/\/www.soundopinions.org\/images\/treasures.jpg","FlickrPhotoSet":"","Videos":""},{"Date":"2.15.2013","Show":"Show 377","Description":"Reggae legend Jimmy Cliff is live in the Sound Opinions studio. Plus, guitar great Richard Thompson goes \"Electric.\"","Guests":"Jimmy Cliff","ShowNotes":"1 Another Grammy night has come and gone, and again it was all about the performances. The award show had its second biggest ratings night since 1993, and one of the biggest newsmakers was someone who wasn’t even eligible for an award: Justin Timberlake. Other big winners were Mumford & Sons and Frank Ocean. Jim and Greg talk about some of the Grammy’s bizarre voting and eligibility rules and compare these winners to those who took home the prize for Village Voice Pazz & Jop Poll.\n\n2 And speaking of Grammys, singer-songwriter Jimmy Cliff walked away with his second “Best Reggae Album” Grammy last week. Rebirth is Cliff’s 30th reggae record in a career that spans the history of the genre. Talking to Jim and Greg, he traces the evolution of reggae from party music celebrating Jamaican independence, to a more introspective music about roots, spirituality, and identity. While he may not be as famous as countryman Bob Marley, Cliff was instrumental in breaking reggae in the U.S. As the starring actor and songwriter for the cult film The Harder They Come, he introduced Americans to Rastafarian culture, dancehall music, and his own hits “You Can Get It If You Really Want” and “The Harder They Come.” Cliff might be a reggae founding father, but he’s no purist. He talks approvingly of punk’s adoption of reggae sounds and even returns the compliment: Rebirth features a cover of The Clash’s “Guns of Brixton,” a song originally inspired by The Harder They Come.\n\n3 To put it simply: our hosts think Richard Thompson is the most revered guitarist working today. And the fact that he’s been doing it and doing it well for over 4 decades is nothing short of a miracle. So yes, that means his latest album, Electric, is a Buy It. Need we say more? (We didn’t think so, but just in case, here’s more from Jim and more from Greg.)\n\n4 It’s always sad to hear of a musician passing, but Jim admits that no death has hit him harder in recent years than that of Reg Presley. The Troggs lead singer was no great talent and no great looker, but he was full of attitude. And The Troggs have an entire catalog of great songs….not just “Wild Thing.” So in his honor, Jim adds “I Can’t Control Myself” to the Desert Island Jukebox this week. ","PullQuote":"","Recurringsegments":"Jim's DIJ","AlbumReviews":"Richard Thompson - Electric","FeaturedSongs":"Justin Timberlake, “Suit & Tie,” 2013 Grammys Telecast Performance, 2013\nFrank Ocean, “Forrest Gump,” 2013 Grammys Telecast Performance, 2013\nJimmy Cliff, “You Can Get It If You Really Want,” The Harder They Come, Island, 1972\nLord Flea and His Calypsonians, “Donkey Bray,” single, Capitol, 1957\nJimmy Cliff, “Fundamental Reggay,” single, EMI, 1973\nDerrick Morgan, “Shake a Leg,” single, Blue Beat, 1961\nJimmy Cliff, “Reggae Music,” Rebirth, Universal\/Sunpower\/Hip-O, 2012\nJimmy Cliff, “The Harder They Come,” The Harder They Come, Island, 1972\nLord Creator, “Independent Jamaica,” single, Island, 1962\nHopeton Lewis, “Take It Easy,” single, Merritone, 1966\nBurning Spear, “Marcus Garvey,” Marcus Garvey, Island, 1975\nJimmy Cliff, “Vietnam,” Jimmy Cliff, Trojan, 1969\nJimmy Cliff, “Many Rivers to Cross,” The Harder They Come, Island, 1972\nJimmy Cliff, “Sitting in Limbo,” The Harder They Come, Island, 1972\nJimmy Cliff, “World Upside Down,” Rebirth, Universal\/Sunpower\/Hip-O, 2012\nThe Clash, “Guns of Brixton,” London Calling, CBS, 1979\nJimmy Cliff, “Guns of Brixton,” Rebirth, Universal\/Sunpower\/Hip-O, 2012\nJimmy Cliff, “Trapped,” single, Island, 1972\nRichard Thompson, “Stuck on the Treadmill,” Electric, New West Records, 2013\nRichard Thompson, “Stony Ground,” Electric, New West Records, 2013\nRichard Thompson, “Good Things Happen to Bad People,” Electric, New West Records, 2013\nRichard Thompson, “Saving the Good Stuff for You,” Electric, New West Records, 2013\nThe Troggs, “I Can’t Control Myself,” single, Fontana, 1966\nKurt Vile, “Wakin’ on a Pretty Day,” Wakin’ on a Pretty Daze, Matador, 2013\nThe Replacements, “Answering Machine,” Let It Be, Twin\/Tone Records, 1984\nThe Jackson 5, “I Want You Back,” Diana Ross Presents the Jackson 5, Motown, 1969\nJefferson Airplane, “Comin’ Back to Me,” Surrealistic Pillow, RCA Victor, 1967\nRedd Kross, “Blow You a Kiss in the Wind,” Teen Babes from Monsanto, Gasatanka Records, 1984","Audio":"http:\/\/audio.soundopinions.org\/streams\/2013\/02\/so_20130215.m3u","MainImage":"http:\/\/www.soundopinions.org\/images\/2013\/jimmycliff.jpg","FlickrPhotoSet":"","Videos":""},{"Date":"2.8.2013","Show":"Show 376","Description":"This Valentine’s Day, Jim and Greg lend the recently-split a helping hand. They list rock n’ roll’s best songs to tell your sweetie “I Want You Back!”","Guests":"","ShowNotes":"1 When candy, flowers, and love notes fail to woo your sweetie back, there’s only one thing left to do: stake out under a window, hold up that boom box and blast an “I Want You Back” song. This Valentine’s Day, Jim and Greg present their favorite Pleading Songs.\n\nJim\nRod Stewart, “You’re in My Heart (The Final Acclaim)\"\nMudhoney, “If I Think”\nYvonne Elliman, “If I Can’t Have You”\nSimple Minds, “Don’t You (Forget About Me)”\n\nGreg\nAl Green, “Can’t Get Next to You”\nThe Spinners, “Working My Way Back to You\"\nBonnie Raitt, “Love Has No Pride”\nAlex Chilton, “Can’t Seem to Make You Mine” \n\n2 Jim and Greg pass the mic to some of the expert beggers in the audience. We hear some listeners’ suggestions for great “I Want You Back” tracks:\n                                      \nHeather in Chesterton, IN \nStranger Cole and Ken Booth, “Uno, Dos, Tres” \nAlex in Portland, OR\nDawes, “Coming Back to a Man\"\nMatthew in Portland, ME \nAretha Franklin, “Don’t Let Me Lose This Dream” \nKathy & John in Raleigh, NC \nPaul Young, \"Come Back and Stay” & Trio, “Out in the Streets\"\n\n3 We highlighted My Bloody Valentine in our Shoegaze genre dissection a few weeks ago, and after 21 years of scattered promises, it seemed to be a pretty safe bet that a 3rd MBV album would never see the light of day. But then on February 2, 2013, mbv was quietly released on their website. Is it even possible for the band to escape from the long shadow of their legendary sophomore album Loveless? Greg says not quite. He thinks that the first few songs rehash Loveless’ glory, but don’t meet its standard. The second half shows the band moving into the future. He anxiously awaits that future, but in the meantime, mbv is a Burn It. Jim thinks the band lost momentum during this two decade hiatus. And while it is no Loveless, mbv is much better than he feared it would be. He gives the record a Buy It.","PullQuote":"","Recurringsegments":"","AlbumReviews":"My Bloody Valentine - mbv","FeaturedSongs":"The Jackson 5, “I Want You Back,” Diana Ross Presents the Jackson 5, Motown, 1969\nRod Stewart, “You’re in My Heart (The Final Acclaim),” Foot Loose & Fancy Free, Warner Bros., 1977\nAl Green, “I Can’t Get Next to You,” Al Green Gets Next to You, Capitol, 1971\nMudhoney, “If I Think,” Superfuzz Bigmuff EP, Sub Pop, 1988\nStranger Cole & Ken Boothe, “Uno Dos Tres,” single, Treasure Isle, 1964\nDawes, “Coming Back to a Man,” Nothing is Wrong, ATO Records, 2011\nMary J. Blige, “I’m Goin’ Down,” My Life, Uptown\/MCA, 1995\nThe Smiths, “Please, Please, Please, Let Me Get What I Want,” single, Rough Trade, 1984\nThe Spinners, “Working My Way Back to You,” Dancin’ and Lovin’, Atlantic, 1979\nYvonne Elliman, “If I Can’t Have You,” Saturday Night Fever: The Original Movie Sound Track, RSO\/Polydor, 1977\nBonnie Raitt, “Love Has No Pride,” Give It Up, Warner Bros., 1972\nAretha Franklin, “Don’t Let Me Lose This Dream,” I Never Loved a Man the Way I Love You, Atlantic, 1967\nPaul Young, “Come Back and Stay,” No Parlez, Columbia, 1983\nTrio, “Out in the Streets,” Trio and Error, Mercury, 1983\nSimple Minds, “Don’t You (Forget About Me),” The Breakfast Club Soundtrack, A&M, 1984\nAlex Chilton, “Can’t Seem to Make You Mine,” single, Fun, 1978\nSpoon, “Stay Don’t Go,” Kill the Moonlight, Merge, 2002\nMy Bloody Valentine, “New You,” mbv, self-released, 2013\nMy Bloody Valentine, “In Another Way,” mbv, self-released, 2013\nTrance Farmers, “Purple Hay,” Dual Form, Stones Throw\/Leaving Records, 2013\nThe Sylvers, “Hot Line,” Something Special, Capitol, 1976\nThe Mars Volta, “Roulette Dares (The Haunt of),” De-Loused in the Comatorium, Gold Standard Laboratories\/Universal, 2003\nJoni Mitchell, “You Turn Me on I’m a Radio,” For the Roses, Asylum, 1972\nThe dB’s, “Living a Lie,” Repercussion, Albion Records, 1982","Audio":"http:\/\/audio.soundopinions.org\/streams\/2013\/02\/so_20130208.m3u","MainImage":"http:\/\/www.soundopinions.org\/images\/2013\/iwantyouback.jpg","FlickrPhotoSet":"","Videos":""},{"Date":"2.1.2013","Show":"Show 375","Description":"Veteran power pop band The dB’s are live in the Sound Opinions studio.","Guests":"The dB's","ShowNotes":"1 Guitarist and Ohio Players frontman Leroy “Sugarfoot” Bonner died of undisclosed causes this week at the age of 69. The group’s string of ‘70s albums for Westbound and Mercury Records, driven by Bonner’s lead vocals and electrifying double-neck guitar work, stands as one of the most impressive runs in funk history. Their distinct sound found new life in the in the late ‘80s and ‘90s as countless hip hop artists sampled the group’s work (a Red Hot Chili Peppers cover of “Love Rollercoaster” on the soundtrack for Beavis and Butthead Do America didn’t hurt either). Greg highlights “Skin Tight” as prime example of Bonner’s musical legacy.\n\n 2 This week the dB’s, one of power pop’s great underexposed bands, stops by the Sound Opinions studio for an interview and a brief live set. The group came together in 1978 as part of New York City’s punk and new wave scene, and put out two classic, but minimally distributed albums before singer\/guitarist Chris Stamey left the group. Two more low profile records followed before the group broke up in 1988. Now the original dB’s lineup is back with a new album, Falling Off the Sky. Jim used to frequently go see this band live in their earliest days, and it’s clear that they haven’t lost a step in their few decades off. During their visit, the band rips through three songs from Falling Off the Sky, and Stamey and co-frontman Peter Holsapple talk with Jim and Greg about their early days in North Carolina, their label woes in the ‘80s, and their decision to reunite not for a paycheck, but just because they were itching to play again. After you hear their interview, check out these two bonus performances: “Happenstance” and “Neverland,” both from their second album Repurcussion.\n\n3 Beyonce has been making a lot of news, with her lip-syncing and Superbowling, but we’re more interested in kid sis Solange. She has a new extended EP out called True, and both Jim and Greg say it’s a perfect, mini release. She sounds nothing like Beyonce and has been embracing alt-R&B and indie rock—exactly what you expect from someone who dragged her brother-in-law to a Grizzly Bear show. Greg is excited to hear her expand her sound even more on a full length album. And Jim compares True to the Scorcese flick After Hours. Solange gets a double Buy It.\n\n4 Greg’s been in a Joni Mitchell phase, and is particularly smitten with the singer\/songwriter’s 1976 release For the Roses. Between her folk phase and her avant-jazz phase, she released this record with the track “You Turn Me On, I’m a Radio.” Is it directed towards a romantic figure? Or a record company one? Add that question to the layers of sounds and influences from country to Latin to jazz, and you’ve got one wonderfully complicated song.","PullQuote":"","Recurringsegments":"Greg's DIJ","AlbumReviews":"Solange - True EP","FeaturedSongs":"Ohio Players, “Love Rollercoaster,” Honey, Mercury, 1975\nOhio Players, “Skin Tight,” Skin Tight, Mercury, 1974\nThe dB’s, “Wonder of Love,” Falling Off the Sky, Bar None Records, 2012\nChris Bell, “I Am the Cosmos,” I Am the Cosmos, Rykodisc, 1992\nThe dB’s, “That Time is Gone,” (Live on Sound Opinions), Falling Off the Sky, Bar None Records, 2012\nThe dB’s, “Black and White,” Stands for Decibels, Albion Records, 1981\nThe dB’s, “The Fight,” Stands for Decibels, Albion Records, 1981\nThe dB’s, “The Adventures of Albatross and Doggerel,” (Live on Sound Opinions), Falling Off the Sky, Bar None Records, 2012\nThe dB’s, “World to Cry,” (Live on Sound Opinions), Falling Off the Sky, Bar None Records, 2012\nThe dB’s, “Dynamite,” Stands for Decibels, Albion Records, 1981\nSolange Knowles, “Losing You,” True EP, Terrible Records, 2012\nSolange Knowles, “Locked in Closets,” True EP, Terrible Records, 2012\nJoni Mitchell, “You Turn Me on I’m a Radio,” For the Roses, Asylum, 1972\nThe Knife, “Full of Fire,” Shaking the Habitual, Rabid\/Brille\/Mute, 2013\nViolent Femmes, “Telephone Book,” 3, Slash, 1989\nTrey Parker, “Up There,” South Park: Bigger, Longer & Uncut, Atlantic, 1999\nYo La Tengo, “Ohm,” Fade, Matador, 2013\nThe Mothers of Invention, “Who Needs the Peace Corps?,” We’re Only in it for the Money, Verve, 1968\nBlondie, “Rapture,” Autoamerican, Chrysalis, 1980","Audio":"http:\/\/audio.soundopinions.org\/streams\/2013\/02\/so_20130201.m3u","MainImage":"http:\/\/www.soundopinions.org\/images\/2013\/thedbs.jpg","FlickrPhotoSet":"","Videos":""},{"Date":"1.25.2013","Show":"Show 374","Description":"Trey Parker and Matt Stone - the creative minds behind South Park and The Book of Mormon - discuss the intersection between music and comedy.","Guests":"Trey Parker & Matt Stone","ShowNotes":"1 Justin Timberlake played a social-media mogul in the movies, but can he do it in real-life? The JT-backed social media site MySpace recently re-launched with a sleeker design and 50 million-plus song library. The company says it’s the internet’s largest legally streamable song library. Or is it? A group representing indie labels like Merge, Domino, and Beggar’s Group is alleging that MySpace has its members’ music up without permission. Will MySpace be able to work out a deal? Given the site’s 27 million unique visitors a month, Greg’s betting the indie labels will find a way to compromise.\n\n2 Jim always suspected rock ‘n’ roll was a hazardous occupation. Now experts at Britain’s Health Department have weighed in, and guess what? It’s true. A study of 1,500 artists across genres concludes that 9.2 percent of rockers die earlier than regular folks. Not only that, but solo artists face twice the death-risk of artists in bands. Researchers speculated that bands provide an extra support network for at-risk stars. Turns out we really do get by with a little help from our friends.\n\n3 It’s time to “Man Up” for a visit from Trey Parker and Matt Stone. They are the dynamic duo behind South Park and the hit Broadway musical The Book of Mormon. “What are they doing on our rock and roll show?” you ask. Well, some of the greatest moments of satire (see last week’s show)  on South Park are musical. In fact, check out our favorites here.\n\nPlus, you could argue the show itself is quite punk rock with it’s no holds barred attitude and lo-fi animation. The show even spawned a Rick Rubin-produced album. Now we have an equally outrageous musical, The Book of Mormon. It tells the story of two Mormon missionaries sent to a remote village in northern Uganda. It’s even “bluer” than South Park, but despite this, or\n perhaps because of it, it’s a smash hit. Trey, Matt and collaborator Robert Lopez have won a slew of Tony Awards and a record-breaking slot on the Billboard chart. So, how’d two Ween, Primus and Prog Rock fans from Colorado end up the toast of Broadway? Trey and Matt explained this and their songwriting philosophy during their visit to our studios. They were in town for the Chicago opening of the play.\n\n4 At the beginning of the New Order review, Greg calls the English band’s latest album Lost Sirens almost a collection of “leftovers.” That can’t bode too well for it. New Order’s music in the 1980’s was undeniably influential. There’d be no LCD Soundsystem or Radiohead without their electronic pop innovations. But, Jim doesn’t hear anything that evokes their Madchester greatness on this effort. He says Trash It. Greg really liked the tracks “I Told You So” and “Hellbent”, so that bumps up his rating to a Burn It.\n\n5 Who knew Denton, TX was a rock capital? There’s Midlake and Neon Indian. Sly Stone was born there! And now we have Parquet Courts. With their 2nd release Light Up Gold, the garage quartet has relocated to Brooklyn and is getting much wider attention. The album is a perfect combination of expert pop craftsmanship and slacker-punk attitude. Jim and Greg grinned through this review, so Parquet Courts gets a double Buy It.","PullQuote":"","Recurringsegments":"","AlbumReviews":"New Order - Lost Sirens\nParquet Courts - Light Up Gold","FeaturedSongs":"Justin Timberlake (feat. Jay-Z), “Suit & Tie,” single, RCA, 2013\nJim Carroll, “People Who Died,” Catholic Boy, Atco, 1980\nMary Kay Bergman, “Blame Canada,” South Park: Bigger, Longer & Uncut, Atlantic, 1999\nRush, “Tom Sawyer,” Moving Pictures, Mercury, 1981\nWeen, “Fat Lenny,” GodWeenSatan: The Oneness, Twin\/Tone Records, 1990\nPrimus, “South Park Theme,” Chef Aid: The South Park Album, Columbia, 1998\nJosh Gad & Company, “Man Up,” The Book of Mormon: Original Broadway Cast Recording, Ghostlight Records, 2011\nOriginal Broadway Cast, “Hello!,” The Book of Mormon: Original Broadway Cast Recording, Ghostlight Records, 2011\nOriginal Broadway Cast, “Turn It Off,” The Book of Mormon: Original Broadway Cast Recording, Ghostlight Records, 2011\nRobert Preston, “Ya Got Trouble,” The Music Man (Original 1957 Broadway Cast), Capitol, 1990\nOriginal Broadway Cast, “All-American Prophet,” The Book of Mormon: Original Broadway Cast Recording, Ghostlight Records, 2011\nAndrew Rannells, “I Believe,” The Book of Mormon: Original Broadway Cast Recording, Ghostlight Records, 2011\nElton John, “Wake Up Wendy,” Chef Aid: The South Park Album, Columbia, 1998\nEric Cartman, “Come Sail Away,” Chef Aid: The South Park Album, Columbia, 1998\nTrey Parker, “Gay Fish,” clip from South Park, unreleased, 2009\nIsaac Hayes, “Theme from Shaft,” Shaft, Enterprise, 1971\nIsaac Hayes & Meat Loaf, “Tonight is Right for Love (With Meredith Baxter-Birney),” Chef Aid: The South Park Album, Columbia, 1998\nNew Order, “Sugarcane,” Lost Sirens, Rhino, 2013\nNew Order, “I Told You So (Crazy World Mix),” Lost Sirens, Rhino, 2013\nNew Order, “Hellbent,” Lost Sirens, Rhino, 2013\nParquet Courts, “Master of My Craft,” Light Up Gold, Dull Tools, 2012\nParquet Courts, “Stoned and Starving,” Light Up Gold, Dull Tools, 2012\nParquet Courts, “Younder is Closer to the Heart,” Light Up Gold, Dull Tools, 2012\nToro y Moi, “Say That,” Anything in Return, Carpark Records, 2013\nThe Replacements, “Answering Machine,” Let It Be, Twin\/Tone Records, 1984\nRandy Newman, “Short People,” Little Criminals, Warner Bros.\/Reprise, 1977\nNellie McKay, “I Wanna Get Married,” Get Away From Me, Columbia, 2004\nGil Scott-Heron, “The Revolution Will Not Be Televised,” Pieces of a Man, Flying Dutchman, 1971\nTom Robinson Band, “Power in the Darkness,” Power in the Darkness, EMI, 1978","Audio":"http:\/\/audio.soundopinions.org\/streams\/2013\/01\/so_20130125.m3u","MainImage":"http:\/\/www.soundopinions.org\/images\/2013\/mattandtrey.jpg","FlickrPhotoSet":"","Videos":""},{"Date":"1.18.2013","Show":"Show 373","Description":"Jim and Greg celebrate the greatest in rock n' roll satire with Best Satirical Songs.","Guests":"","ShowNotes":"1 Hard to believe, but The Beatles are so old that some of their music is now entering public domain in Europe. While a law is in place to extend copyrights in the E.U. from 50 to 70 years, that won’t go into effect until 2014. That means that as of New Year’s Eve 2012, early tracks like “Love Me Do” are up for grabs. Early tracks by Bob Dylan, however, have recently been protected. In order to avoid its catalog going into public domain, Sony Music has taken advantage of the law’s “use it or lose it” clause. They released a compilation aptly titled, The 50th Anniversary Collection: The Copyright Extension Collection, Vol. 1. It’s only available in certain European countries though, so American Dylan fans will have to be willing to pay big bucks on eBay.\n\n2 This is typically the dry season for major album releases, but there have been a lot of buzzworthy singles. Jim and Greg run through some of the big ones. They never thought they’d utter the words “new David Bowie track,” but we’ve got one called “Where Are We Now,” with a Tony Visconti-produced album to follow. Then there’s JT’s new chart-topper “Suit and Tie.” A couple of weeks ago Jim and Greg made a plea for the gentleman of Outkast to come back together, and now we have both Big Boi and Andre 3000 appearing on a remix of Frank Ocean’s “Pink Matter.” But, Andre is quick to squash any reunion rumors. Last, but not least, are the ladies of Destiny’s Child. There’s a new song called \"Nuclear” and plans for the three to appear together during the Superbowl Halftime Show. Guess motherhood has made Beyonce nostalgic.\n\n3 Next week, South Park and Book of Mormon creators Trey Parker and Matt Stone join Jim and Greg in the studio to talk music and comedy. The duo’s trademark musical satire has won them tons of fans - and a few Tony awards. In advance of the boys’ visit, Jim and Greg warm up the crowd with a mix of rock n’ roll’s Best Satirical Songs. Whether they’re pointing a \nfinger at society’s ills or sending up pop music forms, these artists turn the funny up to 11.\n\nGreg’s Picks:\nFrank Zappa & The Mothers of Invention, “Who Needs the Peace Corps?”\nDead Kennedys, “Holiday in Cambodia”\nTim Fite, “I’ve Been Shot”\nDigital Underground, “The Humpty Dance”\n\nJim’s Picks\nBill Cosby, “Hooray for the Salvation Army Band!”\nBeck, “Debra”\nBongwater, “Free Love Messes Up My Life”\nThe Rutles, “Ouch!”\n\n4 Indie veterans Yo La Tengo started making their version of the Velvet Underground’s droning guitar rock in 1984. Jim and Greg have been listening ever since. (Jim – our own “Son of Jersey” - even caught the band’s first show at Maxwell’s in Hoboken). Over 13 albums, Jim says, Yo La’s established itself as a band of impeccable taste. Greg admits their last few contemplative mood records have sounded a bit “samey.” Do they shake things up on the latest release, Fade? Both Greg and Jim say “yes.” The strings and “John Fahey-esque” acoustic guitar are pleasant surprises. As Greg notes, Ira Kaplan and Georgia Hubley’s ruminations on their decades-long relationship give Fade a cohesive feel. It gets a double Buy It.","PullQuote":"","Recurringsegments":"","AlbumReviews":"Yo La Tengo - Fade","FeaturedSongs":"The Beatles, “Love Me Do,” single, Parlophone, 1962\nDavid Bowie, “Where Are We Now?,” The Next Day, Iso Records\/Columbia, 2013\nJustin Timberlake (feat. Jay-Z), “Suit & Tie,” single, RCA, 2013\nFrank Ocean (feat. Big Boi & Andre 3000), “Pink Matter (Remix),” single, self-released, 2013\nDestiny’s Child, “Nuclear,” Love Songs, Legacy Recordings, 2013\nSpinal Tap, “Tonight I’m Gonna Rock You Tonight,” This is Spinal Tap, Polydor, 1984\nThe Mothers of Invention, “Who Needs the Peace Corps?,” We’re Only In It For The Money, Verve, 1968\nBill Cosby, “Hooray for the Salvation Army Band,” Bill Cosby Sings Hooray for the Salvation Army Band!, Warner Bros., 1968\nBrinsley Schwarz, “(What’s So Funny ‘Bout) Peace, Love, and Understanding,” The New Favourites of Brinsley Shwarz, United Artists, 1974\n“Weird Al” Yankovic, “Eat It,” “Weird Al” Yankovic in 3-D, Rock ‘n Roll, 1984\nDead Kennedy, “Holiday in Cambodia,” Fresh Fruit for Rotting Vegetables, Alternative Tentacles, 1980\nBeck, “Debra,” Midnite Vultures, DGC, 1999\nTim Fite, “I’ve Been Shot,” Over the Counter Culture, self-released, 2007\nBongwater, “Free Love Messes Up My Life,” The Big Sell-Out, Shimmy Disc, 1992\nThe Lonely Island, “Attracted to Us,” Turtleneck & Chain, Universal Republic, 2011\nFlight of the Conchords, “Inner City Pressure,” Flight of the Conchords, Sub Pop, 2008\nDigital Underground, “The Humpty Dance,” Sex Packets, Tommy Boy, 1990\nThe Rutles, “Ouch!,” The Rutles, Warner Bros., 1978\nYo La Tengo, “Ohm,” Fade, Matador, 2013\nYo La Tengo, “Well You Better,” Fade, Matador, 2013\nTeebs, “Bern Rhythm,” Ardour, Brainfeeder, 2010\nDe La Soul, “Ring Ring Ring (Ha Ha Hey),” De La Soul is Dead, Tommy Boy, 1991\nAimee Mann & Michael Penn, “I Just Wasn’t Made for These Times,” unreleased live performance, 2000\nRide, “Chelsea Girl,” Ride EP, Creation, 1990\nThe Loop, “Soundhead,” Heaven’s End, Head, 1987\nVerve, “Slide Away,” A Storm in Heaven, Vernon Yard, 1993","Audio":"http:\/\/audio.soundopinions.org\/streams\/2013\/01\/so_20130118.m3u","MainImage":"http:\/\/www.soundopinions.org\/images\/2013\/satiricalsongs.jpg","FlickrPhotoSet":"","Videos":""},{"Date":"1.11.2013","Show":"Show 372","Description":"Indie songstress Aimee Mann visits the Sound Opinions studios.","Guests":"Aimee Mann","ShowNotes":"1 The end of year numbers are in, and the the music industry has something to celebrate. Sales increased by 3% in 2012, driven mostly by digital music. And, what was long suspected has now been confirmed: Adele has topped the charts two years in a row, making her the first artist in the SoundScan era to do this. 2012’s other big winners? Taylor Swift, One Direction, Bieber, and the only act in this year’s top 10 to come close to “rock” – Mumford & Sons. At least Jim and Greg can take solace in the fact that vinyl sales were up yet again. \n\n2 This week Jim and Greg are joined by Aimee Mann. On her latest release Charmer, we get a series of character sketches all about charmers—from the charismatic to the completely narcissistic. As a veteran of the music biz, it’s a topic about which we’re sure Aimee knows a thing or three. But, she insists that the album isn’t just an L.A. story. She does, \nhowever, pull in some impressive celebrities for the vidoes. Check out Jon Hamm and Jon Wurster in the Tom Scharpling-directed “Labrador,”  which is a shot-by-shot remake of Aimee’s classic hit “Voices Carry.” Then there’s Laura Linney in the title track. Amy talks with Jim and Greg about spoofing herself, her affinity for comedians and her feelings about piracy. She also performs songs from the new album, as well as her Oscar-nominated tune “Save Me.”\n\n2b For more Mann-madness, we’ve posted our Top Aimee Man moments here.\n\n3 Two years ago, Bruno Mars won Jim over with his infectious (and ubiquitous) “Lazy Song.” Like its author, “The Lazy Song” was youthful and hard to dislike. Plus, who cab resist Bruno’s \nbackstory? The pop phenom got his start at age four impersonating Elvis in his hometown of Honolulu before founding top-tier production team The Smeezingtons. Having crafted hits for the likes of Cee Lo and Travis McCoy, Bruno released a solo debut, Doo-Wops & Hooligans, in 2011. Late last year we got the follow up, Unorthodox Jukebox. Jim and Greg kick off their review by playing “Gorilla”. It’s “the stupidest song on the album” according to Greg, though there are some other contenders. Bruno’s randy lyrics are nothing to write home about, but even on this record's stinkiest tracks, there are redeeming pop touches – a cool chord progression or a spot-on Prince falsetto. Jim agrees. Bruno Mars may be a lightweight, but his re-workings of Elton John, disco, and Sam Cooke are appealing and melodic. This is appropriation, but it’s good appropriation. Unorthodox Jukebox gets a double Burn it.","PullQuote":"","Recurringsegments":"","AlbumReviews":"Bruno Mars - Unorthodox Jukebox","FeaturedSongs":"Gotye, “Somebody That I Used to Know,” Making Mirrors, Eleven, 2011\nAimee Mann, “Charmer,” Charmer, SuperEgo, 2012\n‘Til Tuesday, “Voices Carry,” Voices Carry, Epic, 1985\nAimee Mann, “Oh Sandy,” unreleased live performance, 2012\nAimee Mann, “Labrador,” (Live on Sound Opinions), Charmer, SuperEgo, 2012\nAimee Mann, “That’s Just What You Are,” I’m With Stupid, Geffen, 1995\nAimee Mann, “How Am I Different?,” Bachelor No. 2 or, the Last Remains of the Dodo, SuperEgo, 2000\nOzark Mountain Daredevils, “Jackie Blue,” It’ll Shine When It Shines, A&M, 1974\nAimee Mann, “Charmer,” (Live on Sound Opinions), Charmer, SuperEgo, 2012\nGilbert O’Sullivan, “Alone Again (Naturally),” Back to Front, MAM, 1972\nAimee Mann, “Save Me,” (Live on Sound Opinions), Magnolia, Warner Brothers, 1999\nAimee Mann, “Nothing is Good Enough (Instrumental),” Magnolia, Warner Brothers, 1999\nBruno Mars, “Locked Out of Heaven,” Unorthodox Jukebox, Atlantic, 2012\nBruno Mars, “Gorilla,” Unorthodox Jukebox, Atlantic, 2012\nBruno Mars, “If I Knew,” Unorthodox Jukebox, Atlantic, 2012\nNosaj Thing, “Snap,” Home, Innovative Leisure, 2013\nBob Dylan and the Band, “Long Distance Operator,” The Basement Tapes, Columbia, 1975\nIsrael Kamakawiwo’ole, “Somewhere Over the Rainbow\/What a Wonderful Life,” Facing Future, Mountain Apple, 1993\nMy Bloody Valentine, “Feed Me With Your Kiss,” Isn’t Anything, Creation, 1988\nThe Smashing Pumpkins, “Geek U.S.A.,” Siamese Dream, Virgin, 1993\nOasis, “Turn Up the Sun,” Don’t Believe the Truth, Big Brother, 2005","Audio":"http:\/\/audio.soundopinions.org\/podcasts\/sooppodshow372.mp3","MainImage":"http:\/\/www.soundopinions.org\/images\/2013\/aimeemann.jpg","FlickrPhotoSet":"","Videos":""},{"Date":"1.4.2013","Show":"Show 371","Description":"Jim and Greg dive into the influential UK genre known as Shoegaze and review the latest record from Outkast's Big Boi.","Guests":"","ShowNotes":"1 To kick off the first show of the new year, Jim and Greg answer some of your questions.\n\n1a Mark from Chicago and John from Lexington, SC want to know how Jim and Greg choose reviews and how they listen to those albums? Jim explains that we first narrow \ndown a list of albums that are either interesting or making news. Then it comes down to what would make a good mix for the show. So if the feature segment is all about soul, we might like to get a little punk at the end. Greg answers part two, and explains that he tries to listen to an album as many times as possible and, most importantly, in as many different scenarios as possible. He hears music very differently whether he is driving down Lake Shore Drive in Chicago or doing dishes at home.\n\n1b This leads to question #2. Nathan in Chicago is looking for suggestions on how to heighten the digital music experience. Can we do better than just headphones in an ipod? Jim and Greg admit they are not always seeking the most hi-fi experience, so they turn to Bob Gendron, copy editor for Music Direct and contributor to the Chicago Tribune. Bob recommends Nathan get a pair of Grado SR-60i headphones. Priced at $79, they give nice bang for the buck. But if Nathan is a high roller who wants his mind blown, Bob refers him to the Audeze LCD-3.\n\n1c Chris from Corvallis, OR emailed interact@soundopinions.org for recommendations on songs to learn to play on ukulele. All the uke players around Sound Opinions H.Q. say that Paul McCartney is a great place to start; the simple pop melodies are perfect for the four-stringed instrument. Greg adds a vote for Weezer. YouTube is filled with ukulele love. Here are some of our other favorites:\n\nhttp:\/\/www.youtube.com\/watch?v=mAMWndHwT-U\nhttp:\/\/www.youtube.com\/watch?v=XWxxTph7ibU\nhttp:\/\/www.youtube.com\/watch?v=dKpzCCuHDVY\n\nGot a question for the critics? Call 888.859.1800 or email interact@soundopinions.org.\n\n2 Today Jim and Greg dive into “Shoegaze.” In the late ‘80s and early ‘90s, this sound developed in the U.K. and was typified by lots of guitar, lots of atmosphere and lots of noise. \nBut while the height of Shoegaze only lasted a few years, its influence looms large today. As Jim and Greg explain, the artists of this movement were students of rock history. They looked at the guitar as something more than a traditional blues instrument. Those hunks of wire and wood could act as a sound machine. You can trace a line from bands like The Velvet Underground and Dinosaur Jr. to key Shoegaze bands like My Bloody Valentine, Lush, Ride and Slowdive. And their desire to marry rock drive with otherworldly ambience is what carries the genre into the present moment. It’s also important to note that while the term “shoegazer” began as derisive—musicians staring at their shoes are no fun to watch—seeing these acts live was really a special, albeit loud, experience.\n\n3 We may not have heard new Outkast since 2006's Idlewild, but one-half of that groundbreaking Atlanta hip hop duo has a new record out. Big Boi’s first solo album, Sir Lucious Leftfoot…The Son of Chico Dusty, came out in 2010 to positive reviews. Now he's followed it up with Vicious Lies & Dangerous Rumours. How does the new record stack up? Well Jim calls it \"hip-hop at its best.\" Big Boi's been playing the rock festival circuit and he's nothing if not ambitious with his collaborations on Vicious Lies. Everyone from indie band Wavves to more traditional hip-hop guest Kid Cudi makes an appearance on this record. For Jim, the songs succeed or fail on the strength of the guest, which makes this only a Burn It album. Greg agrees. Big Boi's solo records mostly remind him of how much he misses Outkast. Can't those two guys get back together already? Vicious Lies & Dangerous Rumours gets a Burn It.","PullQuote":"","Recurringsegments":"","AlbumReviews":"Big Boi - Vicious Lies and Dangerous Rumors","FeaturedSongs":"Lynyrd Skynyrd, “Don’t Ask Me No Questions,” Second Helping, MCA, 1974\nThe Smiths, “Ask,” single, Rough Trade, 1986\nPaul McCartney, “Somewhere,” unreleased live performance, 2008\nMy Bloody Valentine, “Only Shallow,” Loveless, Creation, 1991\nThe Velvet Underground, “Sister Ray,” White Light\/White Heat, Verve, 1968\nThe Byrds, “Eight Miles High,” Fifth Dimension, Columbia, 1966\nCocteau Twins, “Lorelei,” Treasure, 4AD, 1984\nMy Bloody Valentine, “To Here Knows When,” Loveless, Creation, 1991\nMy Bloody Valentine, “I Only Said,” Loveless, Creation, 1991\nMy Bloody Valentine, “Blown a Wish,” Loveless, Creation, 1991\nLush, “Thoughtforms,” Mad Love EP, 4AD, 1990\nLush, “Lovelife,” Split, 4AD, 1994\nRide, “Dreams Burn Down,” Nowhere, Creation, 1990\nRide, “I Don’t Know Where It Comes From,” Carnival of Light, Creation, 1994\nSlowdive, “Sing,” Souvlaki, Creation, 1993\nSlowdive, “Richard,” Hide Your Eyes, bootleg, 2011\nSlowdive, “Shine,” single, Creation, 1991\nThe Besnard Lakes, “Albatross,” The Besnard Lakes Are the Roaring Night, Jagjaguwar, 2010\nBig Boi, “Mama Told Me (feat. Kelly Rowland),” Vicious Lies and Dangerous Rumors, Purple Ribbon\/Def Jam, 2012\nBig Boi, “Apple of My Eye,” Vicious Lies and Dangerous Rumors, Purple Ribbon\/Def Jam, 2012\nBig Boi, “Descending (feat. Little Dragon),” Vicious Lies and Dangerous Rumors, Purple Ribbon\/Def Jam, 2012\nThe Beatles, “Any Time at All,” A Hard Day’s Night, Parlophone, 1964\nAlicia Keys, “Listen to Your Heart,” Girl on Fire, RCA, 2012\nBeck, “I Just Started Hating Some People Today,” single, Third Man Records, 2012\nThe Golden Palominos, “Boy (Go),” Visions of Excess, Celluloid, 1985\nThe Good, The Bad & The Queen, “Herculean,” The Good, The Band & The Queen, Parlophone, 2007","Audio":"http:\/\/audio.soundopinions.org\/streams\/2013\/01\/so_20130104.m3u","MainImage":"http:\/\/www.soundopinions.org\/images\/2012\/shoegaze.jpg","FlickrPhotoSet":"","Videos":""},{"Date":"12.28.2012","Show":"Show 370","Description":"Jim and Greg close out 2012 with their annual Mixtapes.","Guests":"","ShowNotes":"1 What does it say about the music industry when 2011’s highest-earning musician didn’t release any new music? Dr. Dre tops Forbes’ annual list of music industry earners with an income of $110 million, beating out industry heavyweights like Bieber and Macca. But fans are still waiting for Detox – Dre’s highly anticipated follow up to 2001 and The Chronic. So how’d Dre do it? By selling a ton of headphones.\n                                                                \n2 Throughout the year Jim and Greg have paid homage to the musical greats we’ve lost. There were some big names in 2012 – Whitney Houston, Etta James, Levon Helm, Donna Summer, and Davy Jones just to name a few. With the year coming to a close, Jim and Greg take a moment to recognize some artists they didn’t get to: DC’s own Godfather of Go-go Chuck Brown, and Eastern music ambassador Ravi Shankar. They play Brown’s “Bustin’ Loose” and Shankar’s “Dhun (Fast Teental)” from the sitar master’s 1967 Monterey Pop Festival performance in appreciation.\n\n3a As 2012 comes to a close, it’s a great time to think about the songs that defined the year. And what better way to do that than with a mixtapes? During the show you’ll hear a small selection of Jim and Greg’s compilations of the year, but you can stream both mixes in their entirety below. And you can make your own.\n\nHappy New Year from Sound Opinions!\n\n3b Greg Kot’s 2012 Mixtape: “Ways of the World”\n1. Kelly Hogan, “Ways of the World”\n2. Neneh Cherry and the Thing, “Cashback”\n3. Killer Mike, “Untitled”\n4. Nick Waterhouse, “Some Place”\n5. Django Django, “Default”\n6. Santigold, “Disparate Youth”\n7. The Hood Internet, “One for the Record Books”\n8. Wild Belle, “Keep You”\n9. Radar Eyes, “I Am,”\n10. Chromatics, “Kill for Love”\n11. Miguel, “Where’s the Fun in Forever”\n12. Japandroids, “The House that Heaven Built”\n13. Ty Segall Band, “Tell Me What’s Inside Your Heart”\n14. Divine Fits, “Would That Not Be Nice”\n15. Frank Ocean, “Bad Religion”\n16. Cat Power, “Cherokee”\n17. Jack White, “Hysterical Kiss”\n18. Bobby Womack, “The Bravest Man in the Universe”\n\nLaunch Greg's Mixtape\n\n3c Jim DeRogatis’ 2012 Mixtape\n1. Jessie J, “Domino”\n2. Bob Mould, “Star Machine”\n3. Best Coast, “Why I Cry”\n4. Bassnectar, “Pennywise Tribute”\n5. The dB’s, “That Time is Gone”\n\n                                                                6. DIIV, “Past Lives”\n\n                                                                7. El-P, “For My Upstairs Neighbor (Mums the Word)”\n\n                                                                8. Lupe Fiasco, “ITAL (Roses)”\n\n                                                                9. John Cale, “I Wanna Talk 2 U”\n\n                                                                10. Andre Williams & The Sadies, “I Gotta Get Shorty Out of Jail”\n\n                                                                11. Miguel, “Adorn”\n\n                                                                12. Neil Young & Crazy Horse, “Jesus’ Chariot (She’ll Be Coming Around the Mountain”\n\n                                                                13. Passion Pit, “I’ll Be Alright”\n\n                                                                14. Jack White, “Hip Eponymous Poor Boy”\n\n                                                                15. Sinead O’Connor, “4th and Vine”\n\n                                                                \n\n                                                                Launch Jim's Mixtape","PullQuote":"","Recurringsegments":"","AlbumReviews":"","FeaturedSongs":"Dr. Dre, “Fuck wit Dre Day (And Everybody’s Celebratin’),” The Chronic, Death Row, 1992\nWhitney Houston, “The Greatest Love of All,” Whitney Houston, Arista, 1985\nChuck Brown and the Soul Searchers, “Bustin’ Loose,” Bustin’ Loose, Source Records, 1979\nRavi Shankar, “Duhn: Fast Teental (excerpt),” Monterey International Pop Festival [Live], Razor & Tie, 2007\nKelly Hogan, “Ways of the World,” I Like to Keep Myself in Pain, ANTI-, 2012\nDjango Django, “Default,” Django Django, Because Music, 2012\nSantigold, “Disparate Youth,” Master of My Make-Believe, Atlantic, 2012\nBobby Womack, “The Bravest Man in the Universe,” The Bravest Man in the Universe, XL Recordings, 2012\nThe Hood Internet, “One for the Record Books,” FEAT, Decon, 2012\nWild Belle, “Keep You,” single, Columbia, 2012\nRadar Eyes, “I Am,” Radar Eyes, HoZac, 2012\nRhye, “The Fall,” The Fall EP, Innovative Leisure, 2012\nBob Mould, “Star Machine,” Silver Age, Merge, 2012\nDJ Tripp, “Love is Young (Fun. Vs. Pat Benatar),” single, self released, 2012\nJessie J, “Domino,” Who You Are, Lava, 2011\nAndre Williams & The Sadies, “I Gotta Get Shorty Out of Jail,” Night & Day, Yep Rock Records, 2012\nBassnectar, “Pennywise Tribute,” Vava Voom, Amorphous Music, 2012\nJack White, “Hip Eponymous Poor Boy,” Blunderbuss, Third Man, 2012\nAndy Stott, “Numb,” Luxury Problems, Modern Love, 2012\nNick Lowe, “Switchboard Susan,” Labour of Lust, Radar, 1979\nThe Shins, “No Way Down,” Port of Morrow, Aural Apothecary, 2012\nDirty Projectors, “Temecula Sunrise,” Bitte Orca, Domino, 2009\nCold Chisel, “Khe Sahn,” Cold Chisel, Elektra, 1978","Audio":"http:\/\/audio.soundopinions.org\/podcasts\/sooppodshow370.mp3","MainImage":"http:\/\/www.soundopinions.org\/images\/mixtapes.jpg","FlickrPhotoSet":"","Videos":""},{"Date":"12.21.2012","Show":"Show 369","Description":"Jim and Greg explore the history of the Supergroup. Plus they review the new album from \"Girl on Fire\" Alicia Keys.","Guests":"","ShowNotes":"1 This week Jim and Greg ponder the history of the Supergroup. This is the rock phenomenon where musicians from different bands blend together to form a new group. Take one 1 guitar virtuoso, sprinkle in a legendary drummer and add a dash of star singing—sometimes this is a great success, and sometimes the ingredients just don’t mix. Recently there have been a number of new supergroups such as The Good, the Bad and the Queen, Them Crooked Vultures, Tinted Windows, Dead Weather and Monsters of Folk. For Jim the keys to a\n winning supergroup are that the members be individually “super,” and that they have chemistry together. Greg adds that there needs to be more compelling the super-union than just business.\n                                                                \nHere are some hits and misses throughout history:\n\nTraveling Wilburys\nChickenfoot\nMillion Dollar Quartet\nCream\nBlind Faith\nCrosby, Stills, Nash (and Young)\nUK\nGolden Palomino\nElectronic\nTemple of the Dog\nAudioslave\nLucy Pearl\n\n2 Since sweeping the Grammys in 2002 with her debut album, Songs in A Minor, some things have changed for piano pop star Alicia Keys. She's married to producer Swizz Beatz and has a young son named Egypt. Alicia might be a \"Brand New Me,\" but on her fifth studio album, Girl on Fire, she's out to convince us that she's still “red hot.” Does she succeed? Unfortunately, Greg says there's no spark here. While there's no questions Keys has chops, and she's heavily involved in the songwriting, album number five still doesn't let us in on who this pop diva really is. He adds that Alicia reminds him of a talented pro-athlete who, when faced with an interviewer, spouts mindless clichés. Jim agrees—there’s no soul here. Girl on Fire is a piece of pop product circa 2012, and it gets a double Trash It.","PullQuote":"","Recurringsegments":"","AlbumReviews":"Alicia Keys - Girl on Fire","FeaturedSongs":"Traveling Wilburys, “Handle With Care,” Traveling Wilburys Vol. 1, Wilbury\/Warner Bros. Records, 1988\nTinted Windows, “Kind of a Girl,” Tinted Windows, S-Curve, 2009\nChickenfoot, “Soap on a Rope,” Chickenfoot, Redline, 2009\nDamnocracy, “Take It Back,” demo, self released, 2006\nThe Million Dollar Quartet, “Just a Little Walk With Jesus,” The Million Dollar Quartet, Sun Records, 1981\nCream, “SWLABR,” Disraeli Gears, Atco, 1967\nBlind Faith, “Can’t Find My Way Home,” Blind Faith, Polydor, 1969\nThe Good, the Bad & the Queen, “History Song,” The Good, the Bad & the Queen, Parlophone, 2007\nThe Jeff Beck Group, “I Ain’t Superstitious,” Truth, Epic, 1968\nCrosby, Stills, Nash & Young, “Teach Your Children,” Déjà Vu, Atlantic, 1970\nUK, “Night After Night,” Night After Night, E.G. Records, 1979\nAsia, “Heat of the Moment,” Asia, Geffen, 1982\nThe Golden Palominos, “Omaha,” Visions of Excess, Celluloid, 1985\nElectronic, “Get the Message,” Electronic, Factory, 1991\nFoo Fighters, “Everlong,” The Colour and the Shape, Roswell\/Capitol, 1997\nTemple of the Dog, “Hunger Strike,” Temple of the Dog, A&M, 1991\nLucy Pearl, “Don’t Mess With My Man,” Lucy Pearl, EMI, 2000\nAlicia Keys, “Girl on Fire (Inferno Version),” Girl on Fire, RCA, 2012\nAlicia Keys, “Fallin’,” Songs in A Minor, J, 2001\nAlicia Keys, “Brand New Me,” Girl on Fire, RCA, 2012\nThe Black Angels, “Telephone,” Phosphene Dream, Blue Horizon, 2010\nSufjan Stevens, “Justice Delivers Its Death,” Silver & Gold, Asthmatic Kitty, 2012\nTwin Shadow, “Five Seconds,” Confess, 4AD, 2012\nDef Leppard, “Pour Some Sugar on Me (2012 Remastered Version),” single, Bludgeon Riffola\/Mailboat Records, 2012\nThe Coup, “Me and Jesus the Pimp in a ’79 Granada Last Night,” Steal This Album, Dogday Records, 1998","Audio":"http:\/\/audio.soundopinions.org\/podcasts\/sooppodshow369.mp3","MainImage":"http:\/\/www.soundopinions.org\/images\/2012\/supergroups.jpg","FlickrPhotoSet":"","Videos":""},{"Date":"12.14.2012","Show":"Show 368","Description":"Our very own Kris Kringle, Andy Cirzan, joins us for a special soul music edition of our Sound Opinions Holiday Spectacular.","Guests":"Andy Cirzan","ShowNotes":"1 Holiday music maven Andy Cirzan visits Sound Opinions every December to share with Jim and Greg a new collection of unique tunes for the season. From the weird to the wonderful, these are not your standard Christmas carols. By day Andy runs Jam Productions in Chicago. By night he searches through record stores, dustbins and basements to find gems for Sound Opinions and his annual compilation. This edition is called Santa Soul. You'll be treated to holiday soul comps of yesteryear. These are killer Xmas dusties from the '60s and '70s —tracks by well-known artists like James Brown, as well as groovy underground acts. So light up the yule log and let the soul party begin! Cheers from everyone at Sound Opinions!\n\n*As a special bonus, listeners are invited to download Andy Cirzan's complete holiday compilation for FREE at christmas.soundopinions.org. The mix will only be up until the end of 2012, so get it while it's hot! ","PullQuote":"","Recurringsegments":"","AlbumReviews":"","FeaturedSongs":"Betty Lloyd, “Snowflakes Pt. 1,” single, Thomas Records, 1969\nThe Soul Duo, “Just a Sad Xmas,” single, Shiptown, 1969\nThe Stridells, “I Remember Christmas,” single, Curtom, 1970\nJ.J. Barnes, “Snow Flake,” single, Volt, 1969\nThe Soulful Strings, “Merry Christmas Baby,” The Magic of Christmas, Cadet Records, 1968\nJames Brown, “Believers Shall Enjoy (Non Believers Shall Suffer),” single, King Records, 1968\nClarence Reid, “Winter Man,” single, Atlantic Records, 1974\nMargie Joseph, “Christmas Gift,” Funky Christmas, Cotillion, 1976\nThe Meditation Singers, “Spirit of Christmas,” Checker Records, 1968\nMarvin Gaye, “Purple Snowflake,” The Ultimate Motown Christmas Collection, Motown 2009\nJames Brown, “Christmas is Coming,” A Soulful Christmas, King, 1968\nJames Brown, “You Know It’s X-Mas,” A Soulful Christmas, King, 1968\nDonnie Hathaway, “This Christmas,” single, Atco, 1970\nOtis Redding, “Merry Christmas Baby,” single, Atlantic, 1967\nSolomon Burke, “Presents for Christmas,” single, Atlantic, 1966\nJames Brown, “Santa Claus Go Straight to the Ghetto,” A Soulful Christmas, King, 1968\nBetty Lloyd, “Snowflakes Pt. 2,” single, Thomas Records, 1969\nLou Reed, “New York Telephone Conversation,” Transformer, RCA, 1972\nRihanna, “Diamonds,” Unapologetic, Def Jam, 2012\nBlondie, “The Tide is High,” Autoamerican, Chrysalis, 1980\nThe Cairo Gang, “Now You Are One of Us,” The Corner Man, Empty Cellar Records, 2012\nMacklemore & Ryan Lewis, “Thrift Shop,” The Heist, Macklemore LLC\nDaughn Gibson, “Tiffany Lou,” All Hell, White Denim, 2012","Audio":"http:\/\/audio.soundopinions.org\/podcasts\/sooppodshow368.mp3","MainImage":"http:\/\/www.soundopinions.org\/images\/andycirzan.jpg","FlickrPhotoSet":"","Videos":""},{"Date":"12.7.2012","Show":"Show 367","Description":"The big moment has arrived! Jim and Greg reveal the Best Albums of 2012 and hear some of your nominations.","Guests":"","ShowNotes":"1 Jim and Greg have made their lists and checked ‘em twice. Now the big moment has arrived. Without further ado: The Best Albums of 2012.\n\nGreg Kot’s Top Ten of 2012\n\n1. Frank Ocean, Channel ORANGE\nListen to Jim and Greg’s Review\n2. Kendrick Lamar, good kid, m.A.A.d city\nListen to Jim and Greg’s Review\n3. Tame Impala, Lonerism\nListen to Jim and Greg’s Review\n4. Killer Mike, R.A.P. Music\nListen to Jim and Greg’s Review\n5. Kelly Hogan, I Like to Keep Myself in Pain\nListen to Kelly Hogan on Sound Opinions\n6. Japandroids, Celebration Rock\nListen to Japandroids on Sound Opinions\n7. El-P, Cancer 4 Cure\nListen to El-P on Sound Opinions\n8. Neneh Cherry, The Cherry Thing\nListen to Jim and Greg’s Review\n9. The Coup, Sorry to Bother You\nListen to Jim and Greg’s Review\n10. Miguel, Kaleidoscope Dream\nListen to Jim and Greg’s Review\nView Greg’s complete list\n\n2 \nJim DeRogatis’ Top Ten of 2011\n\n1. Tame Impala, Lonerism\nListen to Jim and Greg’s Review\n2. Kelly Hogan, I Like to Keep Myself in Pain\nListen to Kelly Hogan on Sound Opinions\n3. Frank Ocean, Channel ORANGE\nListen to Jim and Greg’s Review\n4. Melody’s Echo Chamber, Melody’s Echo Chamber\n5. Spiritualized, Sweet Heart Sweet Light\nListen to Jim and Greg’s Review\n6. El-P, Cancer 4 Cure\nListen to El-P on Sound Opinions                                                         \n7. Cloud Nothings, Attack on Memory\n                                                \n\n                                                                8. Aimee Mann, Charmer\n\n                                                                \n\n                                                                9. Lupe Fiasco, Food & Liquor II: The Great American Rap Album Pt. 1\n\n                                                                Listen to Jim and Greg’s Review\n\n                                                                \n\n                                                                10. Bat for Lashes, The Haunted Man\n\n                                                                View Jim’s complete list\n\n                                                                        \n\n                                                                3 And some more #1s from the listeners!\n\n                                                                \n\n                                                                Michael, from Chicago, IL\n\n                                                                Cloud Nothings, Attack on Memory\n\n                                                                \n\n                                                                John, from New York, NY\n\n                                                                Kimbra, Vows\n\n                                                                \n\n                                                                Andy, from Mariposa, CA\n\n                                                                Dan Deacon, America","PullQuote":"","Recurringsegments":"","AlbumReviews":"","FeaturedSongs":"El-P, “Drones Over BKLYN,” Cancer for Cure, Fat Possum, 2012\nNeneh Cherry & The Thing, “Too Tough to Die,” The Cherry Thing, Smalltown Supersound, 2012\nSpiritualized, “Get What You Deserve,” Sweet Heart Sweet Light, Double Six Records, 2012\nJapandroids, “The House That Heaven Built,” Celebration Rock, Polyvinyl, 2012\nCloud Nothings, “Wasted Days,” Attack on Memory, Carpark Records, 2012\nGotye, “Somebody That I Used to Know,” Making Mirrors, Eleven, 2011\nKimbra, “Call Me,” Vows, Warner Bros., 2011\nDan Deacon, “USA IV: Manifest,” America, Domino, 2012\nMelody’s Echo Chamber, “Bisou Magique,” Melody’s Echo Chamber, Fat Possum, 2012\nKiller Mike, “Untitled,” R.A.P. Music, Williams Street Records, 2012\nKelly Hogan, “We Can’t Have Nice Things,” I Like to Keep Myself in Pain, ANTI-, 2012\nKendrick Lamar, “Money Trees,” good kid, m.A.A.d. city, Aftermath, 2012\nKendrick Lamar, “Swimming Pools (Drank),” good kid, m.A.A.d. city, Aftermath, 2012\nTame Impala, “Apocalypse Dreams,” Lonerism, Modular Recordings, 2012\nFrank Ocean, “Swee Life,” Channel Orange, Def Jam, 2012\nWilson Pickett, “634-5789,” The Exciting Wilson Pickett, Atlantic, 1966\nGreen River, “Swallow My Pride,” Rehab Doll, Sub Pop, 1988\nSoundgarden, “Non-State-Actor,” King Animal, Seven Four, 2012\nBig Star, “Mod Lang,” Radio City, Ardent Records, 1974\nDead Can Dance, “Children of the Sun,” Anastasis, PIAS Recordings, 2012","Audio":"http:\/\/audio.soundopinions.org\/streams\/2012\/12\/so_20121207.m3u","MainImage":"http:\/\/www.soundopinions.org\/images\/2012\/bestof2012.jpg","FlickrPhotoSet":"","Videos":""},{"Date":"11.30.2012","Show":"Show 366","Description":"Divine Fits – the band with Spoon’s Britt Daniel and Handsome Furs’ Dan Boeckner – is live in the Sound Opinions studio.","Guests":"Divine Fits","ShowNotes":"1 Anyone who has ever taught his or her parent to use an iPhone knows that the older generation doesn’t always mix well with the digital age. But don’t tell that to the Rolling Stones. The veteran rockers are celebrating their 50 years in the business by releasing an app. As Mick explains, the Stones wanted to something “special and innovative.” And of course, they wanna sell stuff. Also coming around to this new fangled digital world is AC\/DC. The longstanding Apple holdouts will finally make their catalog available on iTunes. That just leaves a short list of withholders including Black Sabbath and Garth Brooks.\n\n2 Rihanna hit #1 this week for the first time. Jim and Greg review the new album later in the show, but are interested in the fact that Ri-Ri joined a long list of prominent artists in an open letter to Congress opposing the Internet Radio Fairness Act. Apparently, she doesn’t credit streaming services like Pandora with her success. Members of Maroon 5, Pink Floyd and Katy Perry join Rihanna in saying, we dig you Pandora, but don’t gut our royalties. Check out Greg’s coverage of the debate from the recent Future of Music Summit.\n\n3 Well they are “super” and they are a “group,” but don’t let the categorization make you think any less of the new duo Divine Fits. It combines the talents of Britt Daniel of Spoon Dan Boeckner of Handsome Furs and Wolf Parade, and Sam Brown of New Bomb Turks, along with keyboardist Alex Fischel. Britt and “serial-collaborator” Dan (both veterans of the Sound Opinions studio) share the singing and songwriting duties, and the musical relationship began with just a simple phone call…not an email! The result is the aptly named A Thing Called Divine Fits. Dan credits Sister Nancy as inspiration for the title. Check out video of their live performance.\n\n4 Reigning pop\/R&B queen and hook-singer du jour Rihanna is back with a new release called Unapologetic – her first to top the Billboard albums chart. The 24-year-old Barbadian singer has been all over the news in recent weeks, though not necessarily for her music. By dueting with the man who assaulted her in 2009 (fellow R&B singer Chris Brown on “Nobody’s Business,”\n Rihanna ensured her seventh studio album would be everybody’s business. So how’s the music? Jim calls the upbeat dance-pop fare on the first half of the record “pure pop pleasure.” But when things get sappier and slowed-down on side two, her limits as a vocalist become clear. Greg agrees with Jim that Rihanna’s Chris Brown collab is pure “button-pushing.” He points to her 2009 album Rated R as a more ambitious and successful exploration of that troubled relationship. While he appreciates that the singer is moving in a more serious direction, he laments that the pop hooks just aren’t there. Unapologetic gets a double Burn it.\n\n5 Jim’s DIJ pick was inspired by an article he read recently in The New Yorker. In spite of a life-long hatred of The Grateful Dead, Jim made it through (and even enjoyed!) Nick Paumgarten’s 25,000 words on the world of Deadhead bootleg tape collecting. No, this critic wasn’t converted to the church of Jerry Garcia, but the article did remind him of some particular nasty punk songs with lyrics about the Dead. His favorite, “Pop Songs” by Suicidal Tendencies, is this week’s addition to the jukebox.","PullQuote":"","Recurringsegments":"Jim's DIJ","AlbumReviews":"Rihanna - Unapologetic","FeaturedSongs":"Lily Allen, “Not Fair,” It’s Not Me, It’s You, Regal, 2009\nThe Rolling Stones, “(I Can’t Get No) Satisfaction,” Out of Our Heads, Decca, 1965\nDivine Fits, “Flaggin’ a Ride,” A Thing Called Divine Fits, Merge, 2012\nDivine Fits, “What Gets You Alone,” A Thing Called Divine Fits, Merge, 2012\nSister Nancy, “Bam Bam,” One, Two, Techniques Records, 1982\nDivine Fits, “Would That Not Be Nice,” (Live on Sound Opinions), A Thing Called Divine Fits, Merge, 2012\nDivine Fits, “The Salton Sea,” A Thing Called Divine Fits, Merge, 2012\nDivine Fits, “For Your Heart,” A Thing Called Divine Fits, Merge, 2012\nDivine Fits, “My Love is Real,” (Live on Sound Opinions), A Thing Called Divine Fits, Merge, 2012\nDivine Fits, “Civilian Stripes,” (Live on Sound Opinions), A Thing Called Divine Fits, Merge, 2012\nDivine Fits, “Shivers,” (Live on Sound Opinions), A Thing Called Divine Fits, Merge, 2012\nDivine Fits, “Baby Get Worse,” A Thing Called Divine Fits, Merge, 2012\nRihanna, “Diamonds,” Unapologetic, Def Jam, 2012\nRihanna, “Nobody’s Business (feat. Chris Brown),” Unapologetic, Def Jam, 2012\nSuicidal Tendencies, “Pop Songs,” Free Your Soul and Save My Mind, Suicidal Records, 2000 \nHandsome Furs, “No Feelings,” Sound Kapital, Sub Pop, 2011\nThe Pretenders, “Phone Call,” Pretenders, Sire, 1979\n10,000 Maniacs, “Candy Everybody Wants,” Our Time in Eden, Elektra, 1992\nThe Melvins, “Boris,” Bullhead, Boner Records, 1991\nRenaissance, “Northern Lights,” A Song for All Seasons, Sire, 1978\nDead Can Dance, “Children of the Sun,” Anastasis, PIAS Recordings, 2012 \nSpinal Tap, “(Listen to the) Flower People,” This is Spinal Tap, Polydor, 1984","Audio":"http:\/\/audio.soundopinions.org\/streams\/2012\/11\/so_20121130.m3u","MainImage":"http:\/\/www.soundopinions.org\/images\/2012\/divinefits.jpg\n","FlickrPhotoSet":"","Videos":""},{"Date":"11.23.2012","Show":"Show 365","Description":"Jim and Greg celebrate power pop innovators Big Star. Plus they review King Animal, the new record from grunge godfathers Soundgarden.","Guests":"Jody Stephens","ShowNotes":"1 With Black Friday kicking off the official holiday shopping season, Jim and Greg offer gift recommendations for the music lover in your life:\n\n1a Jim’s been known to rail against Capitol records’ flagrant re-issuing and re-re-issuing of the Beatles catalogue. But even he’s been seduced by the label’s new Beatles Stereo Vinyl Box Set. If your giftee is more of a Pink Floyd type, consider the band’s Reflections and Echoes DVD box set, chock full of rare interview footage. \n\n1b\n\nGreg goes literary with his first pick. In a year that saw big rock biographies from Neil Young and Pete Townshend, he recommends David Bryne’s under-the-radar How Music Works - a book that’s part memoir, part meditation on the musician’s craft. As for music, he recommends the new Bill Withers box set, The Complete Sussex and Columbia Albums.\n\n2 Jim and Greg celebrate the 40th anniversary of Big Star‘s debut album by revisiting their Classic Album Dissection of the band’s first two records, #1 Record and Radio City. #1 Record might be nearing middle age, but the pop sound Big Star pioneered in the seventies is as vibrant as ever. As Jim and Greg discuss, the band changed the history of American music, without\nselling very many records. With a sound that combined Memphis Soul with British Invasion rock, they laid the groundwork for American “Power Pop” and influenced bands including R.E.M., Wilco and The Replacements. The original Big Star lineup included former Box Tops singer Alex Chilton, Chris Bell, Andy Hummel and Jim and Greg’s guest this week, drummer Jody Stephens.\n\n3 Following their discussion with Jody Stephens, Jim and Greg each discuss and play a song. Greg chooses to highlight the opening track from #1 Record called “Feel.” The song was written and performed by Chris Bell. While Alex Chilton is the name most people associate with Big Star, Bell really created it. Most of his incredible work didn’t see the light of day until after his death at age 26, but Greg thinks songs like “Feel,” illustrate the power of his voice and lyrics—many of which convey the problems he faced in his short life.\n\n3b Jim plays a song written and performed by Alex Chilton from the second album called “September Gurls.” As he discussed with Jody earlier in the show, this was a breakout song for the band and one that was immediately adored by critics and fans including The Bangles, who later covered it. Jim’s not sure what the song means, but for him it’s more about the mood that Chilton created. With its sweeping melodies and “pan-sexuality” it’s a power pop classic.\n\n4\n\n“Been Away Too Long” is the first single off Soundgarden’s new album, King Animal. As Jim points out, it’s an understatement. The grunge godfathers have been away for 16 years, ever since conflict between the group’s two big egos – lead singer Chris Cornell and guitarist Kim Thayil – tanked the band. Jim and Greg haven’t looked kindly upon Chris Cornell’s solo\ncareer. Has this former turkey redeemed himself on Soundgarden’s latest? Jim and Greg say no. Greg was heartened by the album’s first three tracks, but he says King Animal quickly devolved into a Chris Cornell solo album with backing band. As far as Jim is concerned, Soundgarden can stay away. He was never a fan and has no use for this record. Soundgarden gets a double Trash it.\n\n5 For his turn at the Desert Island Jukebox, Greg wants to add a song by one of his favorite “Power Pop” bands. The term was actually coined by Pete Townshend during The Who’s pre-rock opera era. It now describes a slew of bands that use big melodies, tight arrangements, harmonies and prominent guitar riffs. The Midwest produced a lot of power pop bands, including Green. The band has had many incarnations, but it’s the constant force of Jeff Lescher that gives the group its edge and puts them above the rest for Greg. He takes their song, “She’s Not a Little Girl” with him to the deserted island.\n\n\n\n\n\n","PullQuote":"","Recurringsegments":"Classic Album Dissection:\nBig Star's \"#1 Record\" & \"Radio City\"","AlbumReviews":"Soundgarden - King Animal","FeaturedSongs":"Isley Brothers, “Special Gift,” The Soul Train Christmas Starfest Album, Epic, 1997 (0:22)\nThe Beatles, “I am the Walrus,” Magical Mystery Tour, Capitol\/Parlophone, 1967 (0:07)\nPink Floyd, “Hey You,” The Wall, Harvest\/EMI, 1979 \nTalking Heads, “Psycho Killer,” Talking Heads: 77, Sire, 1977\nBill Withers, “Lean on Me,” Live at Carnegie Hall, Sussex, 1973 (0:13)\nBig Star, “In the Street,” #1 Record, Ardent, 1972 (0:36)\nBig Star, “My Life is Right,” #1 Record, Ardent, 1972 (0:31)\nBig Star, “Watch the Sunrise,” #1 Record, Ardent, 1972 (0:38)\nBig Star, “The Ballad of El Goodo,” #1 Record, Ardent, 1972 (0:25)\nBig Star, “The India Song,” #1 Record, Ardent, 1972 (0:37)\nBig Star, “The India Song (Alternate Version),” Keep an Eye on the Sky, Rhino, 2009 (1:23)\nBig Star, “When My Baby’s Beside Me,” #1 Record, Ardent, 1972 (0:20)\nBig Star, “Back of a Car,” Radio City, Ardent, 1974 (0:17)\nBig Star, “September Gurls,” Radio City, Ardent, 1974 (0:26)\nBig Star, “O My Soul,” Radio City, Ardent, 1974 (0:48)\nBig Star, “ST 100\/6,” #1 Record, Ardent, 1972 (0:20)\nBig Star, “Feel,” #1 Record, Ardent, 1972 (2:04)\nBig Star, “September Gurls,” Radio City, Ardent, 1974 (2:21)\nThe Replacements, “Alex Chilton,” Pleased to Meet Me, Sire, 1987 (1:12)\nSoundgarden, “Been Away Too Long,” King Animal, Seven Four\/Republic, 2012 (0:29)\nSoundgarden, “Rowing,” King Animal, Seven Four\/Republic, 2012 (1:31)\nGreen, “She’s Not a Little Girl Anymore,” Green, Ganggreen Records, 1986 (2:16)\nThe Beatles, “Any Time at All,” A Hard Day’s Night, Parlophone, 1964 (0:13)\nKendrick Lamar, “Money Trees,” good kid, m.A.A.d. city, Aftermath, 2012 (0:13)\nSoundgarden, “Black Hole Sun,” Superunknown, A&M, 1994 (0:18)\nFiona Apple, “Hot Knife,” The Idler Wheel Is Wiser Than the Driver of the Screw and Whipping Cords Will Serve You\nMore Than Ropes Will Ever Do, Epic, 2012 (0:12)\nGreen Day, “Nightlife,” ¡Dos!, Reprise, 2012 (0:17)\n\n\n\n\n\n","Audio":"http:\/\/audio.soundopinions.org\/streams\/2012\/11\/so_20121123.m3u","MainImage":"http:\/\/www.soundopinions.org\/images\/2009\/bigstar.jpg","FlickrPhotoSet":"","Videos":""},{"Date":"11.16.2012","Show":"Show 364","Description":"Jim and Greg take down the worst musical turkeys of the year in our annual Turkey Shoot. Plus they review the new record from Oakland-based agit-rappers The Coup.\n\n                                                        \n                                                                \n                                                                        \n                                                                                ","Guests":"","ShowNotes":"1 Cassette tapes aren’t just for boutique indie labels anymore. At least that’s what IBM is betting. The company has developed a tiny cassette tape that can store up to 35 terabytes of data, and it’s touting it as the “new” green technology. Unlike server farms, researchers point out, tape at rest consumes zero energy. Need more proof the cassette’s not dead? Greg suggests taking a gander at the rare Radiohead cassette currently up on eBay for 50 grand.\n\n2 Well it’s official: ‘90s nostalgia has arrived. CBS just announced the development of new sitcom, Smells Like Teen Spirit. The show follows a young entrepreneur as he tries to launch an internet startup with help from his “1990’s indie rock parents.” Which got us thinking – what other alt-era hits could be re-purposed as TV pilots? Coming to a station near you, the hilarious rom com Black Hole Sun? Or the detective show Losing My Religion?\n\n3 Thanksgiving is just around the corner, which means it’s time for Sound Opinions’ annual Turkey Shoot. These aren’t just bad records, they’re bad records from artists that are capable of better. Nothing stings like disappointment, and these were the biggest musical disappointments of 2012:\n\nGreg\nWZRD, WZRD\nDead Can Dance, Anastasis\nGary Clark, Jr., Blak and Blu\n\nJim\nDamon Albarn, Dr Dee\nFiona Apple, The Idler Wheel Is Wiser Than the Driver of the Screw and Whipping Cords Will Serve You More Than Ropes Will Ever Do\nGreen Day, ¡Uno!\n\n3b Everyone’s a critic, so Jim and Greg turn the rifle over to the listeners:\nYann in Paris, France: The Shins, Port of Morrow\nBrandon in Cuba, New York: Smashing Pumpkins, Oceania\nJon in Madison, Wisconsin: Kiss, Monster\n\n4 Jim and Greg have their fingers crossed that Sorry to Bother You, the sixth album from Oakland-based hip-hop group The Coup, isn’t a turkey. This band has been making consistently good agit-rap records since 1991, Greg says, but they remain best known for an unfortunate incident involving their cover art. Does the band deliver on Sorry to Bother You? Jim says yes. He wouldn’t blame you for mistaking “The Magic Clap” for a new OutKast party anthem. The Coup has verged dangerously close to Rage Against the Machine self-righteousness in the past, he says, but on Sorry to Bother You, the band’s got the “party to politics” ratio just right. Greg agrees and calls it the best Coup album yet. Sorry to Bother You gets a double Buy it.\n\n5 Soul singer Cody Chesnutt has a new album out, reminding Greg that he’s often left off the list of masterful vocalists. This is clearly evident on his 2002 album The Headphone Masterpiece. In fact, The Roots were such fans they re-worked his song “The Seed” into “The Seed (2.0).” and released it as part of their album Phrenology. Greg takes it with him to the desert island this week.","PullQuote":"","Recurringsegments":"Thanksgiving Turkey Shoot","AlbumReviews":"The Coup - Sorry to Bother You","FeaturedSongs":"Nirvana, “Smells Like Teen Spirit,” Nevermind, DGC, 1991 (0:31)\nOhio Players, “Jive Turkey,” Skin Tight, Mercury, 1974 (0:48)\nWZRD, “Dr. Pill,” WZRD, Universal Republic, 2012 (2:03)\nDamon Albarn, “A Man of England,” Dr Dee, Parlophone, 2012 (1:24)\nDead Can Dance, “Towards the Within,” Into the Labyrinth, 4AD, 1993 (0:15)\nDead Can Dance, “Children of the Sun,” Anastasis, PIAS Recordings, 2012 (1:25)\nJohnny Cash, “Thanks a Lot,” single, Sun Records, 1959 (2:17)\nWilco, “The Thanks I Get,” single, self-released, 2007 (0:41)\nKiss, “All for the Love of Rock and Roll,” Monster, Universal Music Group, 2012 (0:52)\nThe Smashing Pumpkins, “One Diamond, One Heart,” Oceania, EMI, 2012 (0:54)\nThe Shins, “No Way Down,” Port of Morrow, Aural Apothecary\/Columbia Records, 2012 (0:54)\nFiona Apple, “Periphery,” The Idler Wheel Is Wiser Than the Driver of the Screw and Whipping Cords Will Serve You More Than Ropes Will Ever Do, Epic,\n2012 (1:27)\nGary Clark Jr., “Things Are Changin’,” Blak and Blu, Warner Bros. Records, 2012 (1:06)\nGreen Day, “Troublemaker,” ¡Uno!, Reprise, 2012 (1:22)\nThelonius Monk, “Stuffy Turkey,” It’s Monk’s Time, Columbia, 1964 (1:02)\nThe Coup, “Strange Arithmetic,” Sorry to Bother You, ANTI-, 2012 (0:19)\nThe Coup, “The Magic Clap,” Sorry to Bother You, ANTI-, 2012 (1:22)\nThe Coup, “Your Parents’ Cocaine,” Sorry to Bother You, ANTI-, 2012 (0:14)\nThe Roots, “The Seed (2.0),” Phrenology, MCA\/Geffen, 2002 (2:22)\nLou Reed, “New York Telephone Conversation,” Transformer, RCA, 1972 (0:29)\nJames Brown, “(Call Me) Super Bad,” Revolution of the Mind, Polydor, 1971 (0:23)\nKendrick Lamar, “The Art of Peer Pressure,” good kid, m.A.A.d. city, Aftermath, 2012 (0:42)\nU2, “Gloria,” Under a Blood Red Sky, Island, 1983 (0:40)\n\n\n\n\n\n","Audio":"http:\/\/audio.soundopinions.org\/streams\/2012\/11\/so_20121116.m3u","MainImage":"http:\/\/www.soundopinions.org\/images\/turkeyshoot.jpg","FlickrPhotoSet":"","Videos":""},{"Date":"11.09.2012","Show":"Show 363","Description":"Experimental art rocker and Velvet Underground founder John Cale is live in the Sound Opinions studio.","Guests":"John Cale","ShowNotes":"1 Taylor Swift, not surprisingly, continues her hit-making reign with a new #1 album called Red. But how she arrived at this top slot is curious, especially considering music industry trends. Her record label Big Machine kept the album off streaming services during its first week. That might’ve forced fans out to the retail outlets. However, it contradicts the success Mumford and Sons was able to achieve with the heavily-streamed Babel. There’s just no making sense of rock and roll.\n\n2 The votes have been tallied and the results are in! No, not those results. The Mercury Prize, of course. Britain’s prestigious music prize has been awarded to the “Boffin Rock” band Alt-J. These young lads beat out Django Django, Richard Hawley and Field Music, among others. What will they do with their £20,000? Dinner with Mum and Dad, of course.\n\n3 When John Cale first visited Sound Opinions in 2005 as part of our debut on public radio, he shocked us all by name-dropping “Snoop Dogg,” “The Neptunes” and the “MPC.” These influences have come to fruition on the Welshman’s latest recording Shifty Adventures in Nookie Wood. And Jim and Greg were excited to have him come by the studios to perform the new \nmaterial. Plus, there’s no lack of things to talk about with Cale, considering his decades-long career that includes founding The Velvet Underground and producing music by the likes of Patti Smith and The Stooges. After you hear the interview, check out this bonus track.\n\n4 The Psychedelic era might’ve predated the boys in Tame Impala by about half a century, but it’s the major musical influence on this Australian band. The brainchild of Perth’s Kevin Parker, Tame Impala was discovered on MySpace. The band’s debut, Innerspeaker, was mixed by longtime Flaming Lips producer Dave Fridmann. Fridmann was also on board for the band’s latest, Lonerism. As its name suggests, Lonerism is about someone who doesn’t fit in. But Greg says Parker cannily avoids solipsism by cloaking his melancholy songs in uplifting (and obsessively detailed) pop production. It’s a Buy It record for him. Jim agrees. Tame Impala delivers psychedelic transcendence while remaining Britney Spears-catchy. Lonerism gets an enthusiastic double Buy It.\n\n5 It was movie night recently in Jim’s “Critiquing the Arts” class at Columbia College. He and his students sat down to watch Almost Famous – still the only feature film he knows about rock criticism. The film’s opening number “The Oogum Boogum Song” blew his students away, so this week Jim pays homage to this hidden gem with his Desert Island Jukebox pick. “The Oogum Boogum Song” is the work of R&B singer Brenton Wood, a Compton native and fan of Sam Cooke who narrowly avoided being a one hit wonder with his other hit, “Gimme Little Sign.” Jim puts “The Oogum Boogum Song” alongside other nonsense rock classics like “MMMBop” and “Tutti Frutti.”","PullQuote":"","Recurringsegments":"Jim's DIJ","AlbumReviews":"Tame Impala - Lonerism","FeaturedSongs":"Taylor Swift, “Begin Again,” Red, Big Machine, 2012\nAlt-J, “Something Good,” An Awesome Wave, Infectious Music, 2012\nJohn Cale, “Nookie Wood,” Shifty Adventures in Nookie Wood, Double Six, 2012\nJohn Cale, “Leaving it Up to You,” Helen of Troy, Island, 1975\nJohn Cale, “Catastrofuk,” (Live on Sound Opinions), Extra Playful EP, Domino\/Double Six, 2011\nJohn Cale, “Mary,” Shifty Adventures in Nookie Wood, Double Six, 2012\nJohn Cale, “I Wanna Talk 2 U,” Shifty Adventures in Nookie Wood, Double Six, 2012\nJohn Cale, “Face to the Sky,” (Live on Sound Opinions), Shifty Adventures in Nookie Wood, Double Six, 2012\nPatti Smith, “Land,” Horses, Arista, 1975\nThe Stooges, “No Fun,” The Stooges, Elektra, 1965 (0:34)\nJohn Cale, “December Rains,” (Live on Sound Opinions), Shifty Adventures in Nookie Wood, Double Six, 2012\nJohn Cale, “Vampire Cafe,” Shifty Adventures in Nookie Wood, Double Six, 2012\nTame Impala, “Elephant,” Lonerism, Modular Recordings, 2012\nTame Impala, “Be Above It,” Lonerism, Modular Recordings, 2012\nBrenton Wood, “The Oogum Boogum Song,” Oogum Boogum, Double Shot, 1967\nTame Impala, “Endors Toi,” Lonerism, Modular Recordings, 2012\nThe Black Angels, “Telephone,” Phosphene Dream, Blue Horizon, 2010\nThe Turtles, “The Grim Reaper of Love,” single, White Whale, 1966\nThe Scotland Yard Gospel Choir, “Aspidistra,” The Scotland Yard Gospel Choir, Bloodshot Records, 2007\nJames Brown, “Night Train,” Live at the Apollo, Polydor, 1963\nThe “5” Royales, “Think,” single, King, 1957","Audio":"http:\/\/audio.soundopinions.org\/streams\/2012\/11\/so_20121109.m3u","MainImage":"http:\/\/www.soundopinions.org\/images\/2012\/johncale.jpg","FlickrPhotoSet":"","Videos":""},{"Date":"11.02.2012","Show":"Show 362","Description":"Fifty years after it was recorded, Jim and Greg give James Brown's Live at the Apollo a Classic Album Dissection.","Guests":"R.J. Smith","ShowNotes":"1 Singer-songwriter Terry Callier never got the acclaim he deserved in the early part of his life, but as Greg explains, his influence was strong. The Chicago native released a Chess Records debut in 1968, and went on to fuse folk with jazz and experimental music. It’s a sound that caught the attention of younger artists like Beth Orton and Devendra Banhart. And you can best hear it on the 1973 track “You’re Goin Miss Your Candyman.” \n\n2 Before he was America’s Godfather of Soul, James Brown was the king of the South’s segregated chitlin’ circuit. It took Live at the Apollo – an album recorded fifty years ago last month on Brown’s own dime– to catapult him onto the national stage. In honor of its fiftieth, Jim and Greg give Brown’s Live at the Apollo a well-deserved Classic Album Dissection with help from music writer RJ Smith. RJ’s biography of Brown, The One: The Life and Music of James Brown, came out earlier this year. As RJ explains, James Brown was all about the live experience. He knew if radio listeners could just hear his live show, he could be “Gary Cooper big.” He was right. High-energy numbers like “Night Train” and “Think” propelled Brown onto the pop charts and super-charged his career. But as Greg notes, Live at the Apollo wasn’t just a turning point for Brown personally, it was a turning point for music. Suddenly doo-wop and soul was starting to sound…funky.\n\n3 It’s been a busy 2012 for Neil Young. Not only has he given us a memoir, Waging Heavy Piece, he’s also given us two albums. This spring we got the antique folk romp Americana. Now we have Psychedelic Pill – an epic three records’ worth of psychedelic guitar from Neil and the band he was born to play with, Crazy Horse.  How good a prescription is Psychedelic Pill? Greg’s the first to admit there’s a lot of flab on this record. But standout tracks like “Ramada Inn” (about an affair gone sour) and “Walk Like a Giant” (in which Neil reflects on the hippie dream) make this record a worthwhile, if lengthy, listen. Greg says Burn It. As much as it pains him, Neil’s #1 fan Jim DeRogatis has to disagree. Never has he heard worse lyrics or more self-indulgent guitar from Neil. This record is sprawling in a bad way. Jim says Trash It.\n\n4 At 25, Kendrick Lamar is shouldering some pretty heavy expectations for his major label debut, Good Kid, M.A.A.D. City. The Compton rapper caught the attention of Dr. Dre and rap tastemakers with his independent debut Section.80. Does Good Kid, M.A.A.D. City live up to all the hype? Jim acknowledges Kendrick’s skill as a lyricist – he says his rhymes are almost novelistic – and he understands he is taking on characters in his songs. However he’s troubled by the gangsta clichés. No amount of self-awareness, Jim says, makes it ok to indulge in 50 Cent-style misogyny. Jim gives Good Kid, M.A.A.D. City a Trash It rating. Greg couldn’t disagree more. He thinks Lamar has yet to meet the rap cliché he couldn’t upend. Good Kid, M.A.A.D. City is wrestling with Compton’s legacy in a way that eludes sound bites and lyrics-quoting. Greg says it’s a Buy It record that requires close listening.","PullQuote":"","Recurringsegments":"Classic Album Dissection - James Brown's \"Live at the Apollo\"","AlbumReviews":"Neil Young & Crazy Horse - Psychedelic Pill\nKendrick Lamar - good kid, m.A.A.d. city","FeaturedSongs":"Terry Callier, “900 Miles,” The New Folk Sound of Terry Callier, Prestige, 1968\nTerry Callier, “You Goin’ Miss Your Candyman,” What Color is Love, Cadet, 1972\nJames Brown & The Famous Flames, “I’ll Go Crazy,” Live at the Apollo, Polydor, 1963\nThe Swanee Quintet, “Take the Lord with You,” Take the Lord with You, MCA, 1998\nLittle Richard, “Tutti Frutti,” Here’s Little Richard, Specialty Records, 1957\nJames Brown & The Famous Flames, “I Don’t Mind,” Live at the Apollo, Polydor, 1963\nJames Brown & The Famous Flames, “Try Me,” Live at the Apollo, Polydor, 1963\nJames Brown & The Famous Flames, “Medley: Please, Please, Please\/You’ve Got The Power\/I Found Someone\/Why Do You Do Me\/I Want You \nSo Bad\/I Love You, Yes I Do\/Strange Things Happen\/Bewildered\/Please, Please, Please,” Live at the Apollo, Polydor, 1963\nJames Brown & The Famous Flames, “I Don’t Mind,” Live at the Apollo, Polydor, 1963\nJames Brown & The Famous Flames, “Lost Someone,” Live at the Apollo, Polydor, 1963\nJames Brown & The Famous Flames, “Night Train,” Live at the Apollo, Polydor, 1963\nJames Brown & The Famous Flames, “Introduction to James Brown and The Famous Flames,” Live at the Apollo, Polydor, 1963\nJames Brown & The Famous Flames, “Medley: Please, Please, Please\/You’ve Got The Power\/I Found Someone\/Why Do You Do Me\/I Want You \nSo Bad\/I Love You, Yes I Do\/Strange Things Happen\/Bewildered\/Please, Please, Please,” Live at the Apollo, Polydor, 1963\nJames Brown & The Famous Flames, “Night Train,” Live at the Apollo, Polydor, 1963\nJames Brown & The Famous Flames, “Think,” Live at the Apollo, Polydor, 1963\nJames Brown & The Famous Flames, “Night Train,” Live at the Apollo, Polydor, 1963\nNeil Young & Crazy Horse, “Driftin’ Back,” Psychedelic Pill, Reprise, 2012\nNeil Young & Crazy Horse, “Walk Like a Giant,” Psychedelic Pill, Reprise, 2012\nKendrick Lamar, “Swimming Pools (Drank),” good kid, m.A.A.d. city, Aftermath, 2012\nKendrick Lamar, “good kid,” good kid, m.A.A.d. city, Aftermath, 2012\nTonikom, “Hope,” Found and Lost, Hymen Records, 2012\nDe La Soul, “Ring Ring Ring (Ha Ha Hey),” De La Soul is Dead, Tommy Boy, 1991\nVanilla Fudge, “Season of the Witch,” Renaissance, Atco Records, 1968\nFrank Zappa, “Zomby Woof,” Over-Nite Sensation, Disc-Reet, 1973\nHelium, “Wanna Be a Vampire Too, Baby,” Pirate Prude EP, Matador, 1994\nBlue Oyster Cult, “Godzilla,” Spectres, Columbia, 1977","Audio":"http:\/\/audio.soundopinions.org\/streams\/2012\/11\/so_20121102.m3u","MainImage":"http:\/\/www.soundopinions.org\/images\/2012\/jamesbrown.jpg","FlickrPhotoSet":"","Videos":""},{"Date":"10.26.2012","Show":"Show 361","Description":"Jim and Greg comb their record collections for the best tracks about Monsters for this year’s Sound Opinions Halloween Special.\n\n                                                                        ","Guests":"","ShowNotes":"1a Every Halloween Jim and Greg like to celebrate with music. And this year they focused on monsters. From vampires to werewolves to Jim’s favorite, zombies, here are a selection of tunes for your next monster bash.\n\nGreg\nThe Cramps, “Human Fly”\nTV on the Radio, “Wolf Like Me”\nOutKast, “Dracula's Wedding”\nDonovan, “Season of the Witch”\n\nJim\nConcrete Blonde, “Bloodletting”\nNew York Dolls, “Frankenstein”\nThe Five Blobs, “Beware of the Blob”\nBlue Oyster Cult, “Godzilla”\n\n1b As always, on Sound Opinions everyone is a critic. So we also hear from some Halloween loving listeners.\nMary Lou from Los Angeles, “Zombie” by The Fallouts\nJason from Chicago, “The Shankill Butcher” by The Decemberists  \nLeah from Chicago, “Teenage Ghouls Out for Blood” by American Werewolves\nDave from Saint Charles, IL, “Dead Man’s Party” by Oingo Boingo\n\n2 How could we not end the Halloween special with a band from Salem, Massachusetts?() Metal group Converge has a new album out called All We Love We Leave Behind, and it continues their successful two-decade run. Converge is often referred to as “smart metal,” but Jim thinks “ambitious metal” is more apt. This especially applies to the drummer’s range of almost jazzy \nrhythms. Greg says few bands combine aggression with virtuosity better than Converge. The soundscapes are dreamlike and the guitar bursts mind-boggling. All We Love We Leave Behind gets two Buy It ratings.","PullQuote":"","Recurringsegments":"","AlbumReviews":"Converge - All We Love We Leave Behind","FeaturedSongs":"Bobby “Boris” Pickett and the Crypt-Kickers, “Monster Mash,” The Original Monster Mash, Garpax, 1962\nNew York Dolls, “Frankenstein,” New York Dolls, Mercury, 1973\nThe Cramps, “Human Fly,” Gravest Hits EP, Illegal, 1979\nThe Five Blobs, “The Blob,” single, Columbia, 1958\nThe Fall-Outs, “Zombie,” Sleep, Super Electro Sound Recordings, 1994\nThe Decemberists, “Shankill Butchers,” The Crane Wife, Capitol\/Rough Trade, 2006\nWarren Zevon, “Werewolves of London,” Excitable Boy, Asylum, 1978\nRoky Erickson and the Aliens, “I Walked With a Zombie,” Roky Erickson and the Aliens, CBS, 1980\nTV on the Radio, “Wolf Like Me,” Return to Cookie Mountain, Interscope, 2006\nConcrete Blonde, “Bloodletting (The Vampire Song),” Bloodletting, I.R.S., 1990\nOutKast, “Dracula’s Wedding,” Speakerboxxx\/The Love Below, LaFace, 2003\nAmerican Werewolves, “Teenage Ghouls Out for Blood,” We Won’t Stay Dead, Superhero Records, 2005\nOingo Boingo, “Dead Man’s Party,” Dead Man’s Party, MCA, 1995\nBlue Oyster Cult, “Godzilla,” Spectres, Columbia, 1977\nDonovan, “Season of the Witch,” Sunshine Superman, Epic, 1966\nConverge, “Vicious Muse,” All the Love We Leave Behind, Epitaph, 2012\nConverge, “Empty on the Inside,” All the Love We Leave Behind, Epitaph, 2012\nConverge, “Coral Blue,” All the Love We Leave Behind, Epitaph, 2012\nVitalic, “The March of Skabah,” Rave Age, self released, 2012\nThe Beatles, “Any Time at All,” A Hard Day’s Night, Parlophone, 1964\nElvis Presley, “Burning Love,” Burning Love and Hits from His Movies, Volume 2, RCA Camden, 1972\nPassion Pit, “Sleepyhead,” (Live on Sound Opinions), Manners, Frenchkiss, 2009\nDavid Bowie, “Suffragette City,” The Rise and Fall of Ziggy Stardust and the Spiders of Mars, RCA, 1972","Audio":"http:\/\/audio.soundopinions.org\/streams\/2012\/10\/so_20121026.m3u","MainImage":"http:\/\/www.soundopinions.org\/images\/2012\/monsters.jpg","FlickrPhotoSet":"","Videos":""},{"Date":"10.19.2012","Show":"Show 360","Description":"Ty Segall and his band join Jim and Greg onstage for a special live taping of Sound Opinions at Chicago’s Lincoln Hall.","Guests":"Ty Segall","ShowNotes":"1 With the Zune dead and buried, Microsoft is ready for try two at breaking into the digital music industry. This time, Jim reports, they’re bringing out the big guns, introducing their new music and entertainment service under the industry-leading Xbox brand. That’s right kids – Xbox isn’t just for gaming anymore. If Microsoft has its way, it’ll soon be your center for music streaming, buying, and sharing. Is it too late for Microsoft to regain its mojo and compete with Apple, Spotify, and Pandora? Jim says only time will tell, but Microsoft’s certainly ceded a lot of ground since its world dominance in the nineties.\n\n2 After notorious border checkpoint Sierra Blanca busted yet another music industry star this week, Greg takes it upon himself to issue a PSA to all tour bus drivers: if you know what’s good for you, clean out your bus! Since 2010 the checkpoint has caught Willie Nelson, Snoop Dogg, and Fiona Apple in the act of transporting drugs (and the occasional gun) across the border. Now we have Nelly, busted for an impressive 36 pounds of heroin, ten pounds of pot, and a loaded pistol. Guess he’ll know better next time.\n\n3 Knowing Jim and Greg’s affection for pop melodies smothered in noise, it should come as no surprise that Ty Segall’s music hits them right in the sweet spot. The 24-year-old musician was born in Orange County California, but made his name in San Francisco’s thriving garage rock revival scene. Ty is nothing if not prolific. Since 2008 he’s released eight albums, including three this year: Hair in April, Slaughterhouse in June, and now Twins in October. Shortly after Slaughterhouse’s release Ty and his band joined Jim and Greg onstage at Lincoln Hall in Chicago for a live taping of Sound Opinions. He talked about the MTV reality show that ruined his hometown, his early punk influences, and his love of old garage rock. And of course, he and the band performed a raucous live set (we’ve only just regained our hearing).\n\n4 Kaleidoscope Dream, the new album by Miguel debuted at #3 on the Billboard chart. But he’s still an unfamiliar name to most people. The R&B singer and songwriter had moderate success with his first record and has penned songs for Mary J. Blige and Usher. And with this sophomore effort, he really goes all out. You can hear influences from all over the map – from Marvin Gaye to The Zombies. But it’s his unique spin and musical chops that make Jim and Greg give the album an enthusiastic double Buy It.\n\n5 Jim was a fan of Grizzly Bear back when the band appeared on Sound Opinions in 2009. But something was missing from their album Veckatimist. Who knew that “something” was a little Coldplay? The harder rocking stomp and grandeur on Shields fits perfectly with their beautiful harmonies and baroque-pop craftsmanship, according to Jim. He says Buy It. Greg loves Grizzly Bear’s take on chamber pop, and especially the drumming on Shields. But he’s missing a sense of immediacy on the songs. So Greg goes with a Burn It.\n\n                                                                ","PullQuote":"","Recurringsegments":"","AlbumReviews":"Miguel - Kaleidoscope Dream\nGrizzly Bear - Shields","FeaturedSongs":"Aaliyah, “Try Again,” Romeo Must Die: The Album, Blackground, 2000\nRay Charles, “Busted,” Ingredients in a Recipe for Soul, ABC, 1963\nTy Segall, “Would You Be My Love,” Twins, Drag City, 2012\nLe Shok, “She Prefers Whips,” Hey Brother Volume 4, Vegas Records, 1998\nThe Mermen, “Ocean Beach,” Krill Slippin’, Beach Recordings, 1995\nTy Segall Band, “Diddy Wah Diddy,” Slaughterhouse, Drag City, 2012\nThe 13th Floor Elevators, “You’re Gonna Miss Me,” The Psychedelic Sounds of the 13th Floor Elevators, International Artists, 1966\nTy Segall Band, “Death,” (Live on Sound Opinions), Slaughterhouse, Drag City, 2012\nTy Segall, “You’re the Doctor,” Twins, Drag City, 2012\nTy Segall, “Thank God for Sinners,” Twins, Drag City, 2012\nTy Segall & White Fence, “The Tongue,” Hair, Drag City, 2012\nTy Segall, “Goodbye Bread,” Goodbye Bread, Drag City, 2011\nTy Segall, “Finger,” (Live on Sound Opinions), Melted, Drag City, 2010\nTy Segall, “Love Fuzz,” Twins, Drag City, 2012\nThe Troggs, “I Want You,” Wild Thing, Fontana, 1966\nTy Segall Band, “Wave Goodbye,” (Live on Sound Opinions), Slaughterhouse, Drag City, 2012\nTy Segall, “Who Are You,” Twins, Drag City, 2012\nMiguel, “Adorn,” Kaleidoscope Dream, RCA, 2012\nMiguel, “Sure Thing,” All I Want is You, Jive, 2010\nMiguel, “Kaleidoscope Dream,” Kaleidoscope Dream, RCA, 2012\nMiguel, “Don’t Look Back,” Kaleidoscope Dream, RCA, 2012\nGrizzly Bear, “Yet Again,” Shields, Warp, 2012\nGrizzly Bear, “A Simple Answer,” Shields, Warp, 2012\nAraabMuzik, “After Hours,” Electronic Dream 2, self released, 2012\nGrateful Dead, “Operator,” American Beauty, Warner Bros., 1970\nThe Doobie Brothers, “The Doctor,” Cycles, Capitol, 1989\nYoung Marble Giants, “Constantly Changing,” Colossal Youth, Rough Trade, 1980\nMumford & Sons, “Lover of the Light,” Babel, Island, 2012","Audio":"http:\/\/audio.soundopinions.org\/streams\/2012\/10\/so_20121019.m3u","MainImage":"http:\/\/www.soundopinions.org\/images\/2012\/tysegall.jpg","FlickrPhotoSet":"","Videos":""},{"Date":"10.12.2012","Show":"Show 359","Description":"Passion Pit frontman Michael Angelakos joins Jim and Greg in the studio for a frank conversation and live performance.","Guests":"Michael Angelakos","ShowNotes":"1 Foes of digital music have often cited streaming services like Pandora as the reason for the demise of the middle-of-the-road musician. Sure, artists like Drake and Coldplay can succeed, but what about everyone else? Well, Tim Westergren, Pandora's founder has revealed some surprising sales numbers that put this idea to rest. He says Pandora pays over 2,000 artists more than $10,000 a year, and over 800 artists make $50,000. Of course, it's only the Adeles of the world that can rake in $1 million, but that still bodes pretty well for many working musicians.\n\n2 This week, Passion Pit frontman Michael Angelakos is in the studio with Jim and Greg for a frank conversation and stripped-back live set. As Michael tells Jim and Greg, the band began with a belated Valentine’s Day present. Angelakos – then a student at Boston’s Emerson College - posted a track he’d written for his girlfriend to MySpace. “Sleepyhead” quickly exploded on the net. Passion Pit have since released two critically acclaimed albums and toured the world. Their latest release, Gossamer combines upbeat dance tracks and high production values with lyrics that explore Angelakos’s own experience with addiction and mental illness. (As Michael tells Jim and Greg, the band had to cancel dates this year so that he could deal with issues related to his manic depression). The contrast between upbeat music and dark lyrics, Michael explains, is what he’s always found interesting in pop music, and it’s the key to the Passion Pit project. Despite Gossamer’s harrowing content, Michael says the album is ultimately hopeful – an effort to achieve transcendence amid tough circumstances.\n\n3 Wanda Jackson, Queen of Rockabilly since 1954, is out with a new album. Unfinished Business – like last year’s The Party Ain’t Over – is produced by a young fan. This time, Jim explains, it’s Justin Townes Earle, not Jack White, at the helm. Neither Jim nor Greg was a fan of the Caribbean-flavored, White-produced The Party Ain’t Over. Does Earle fare better? Greg says yes. You have to remember, he says, that in addition to being rockabilly royalty, Jackson has a background in country and gospel. She sounds perfectly at home covering artists like Freddy King and Etta James. Greg gives Unfinished Business a Buy It.\n Jim agrees that Earle played it smart by keeping Wanda in her comfort zone and allowing her feistiness to shine through. But he says there are three or four other Jackson albums he’d recommend over this one. He gives Unfinished Business a Burn It.\n\n4 As the presidential election approaches, Greg’s thoughts turn to the terrific L.A. band X. He picks “The New World,” the leadoff track on the band’s 1983 album, More Fun in the New World, for this week’s DIJ. For Greg, this song perfectly reflects the meaning (or lack thereof) of a presidential election for society’s have-nots. In the song, X takes the perspective of a politically apathetic homeless person. Whoever wins the election, he explains, nothing really changes for those at the bottom of the economic latter. But the song’s narrator doesn’t totally lose hope. In the chorus he urges the politicians of the day: “Don’t forget the motor city!\"\n","PullQuote":"","Recurringsegments":"DIJ - Greg\n\nAs the presidential election approaches, Greg’s thoughts turn to the terrific L.A. band X. He picks “The New World,” the leadoff track on the band’s 1983 album, More Fun in the New World, for this week’s DIJ. For Greg, this song perfectly reflects the meaning (or lack thereof) of a presidential election for society’s have-nots. In the song, X takes the perspective of a politically apathetic homeless person. Whoever wins the election, he explains, nothing really changes for those at the bottom of the economic latter. But the song’s narrator doesn’t totally lose hope. In the chorus he urges the politicians of the day: “Don’t forget the motor city!”\n\n                                                                \n\n","AlbumReviews":"Wanda Jackson - Unfinished Business","FeaturedSongs":"Drake (feat. The Weeknd), “Crew Love,” Take Care, Young Money, 2011\nPassion Pit, “Take a Walk,” Gossamer, Columbia, 2012\nMary O’Hara, “Óró Mo Bhaidin,” Songs of Ireland, Tradition, 1958\nPassion Pit, “Sleepyhead,” Manners, Frenchkiss, 2009\nPassion Pit, “Little Secrets,” Manners, Frenchkiss, 2009\nPassion Pit, “Constant Conversations,” (Live on Sound Opinions), Gossamer, Columbia, 2012\nPassion Pit, “Cuddle Fuddle,” Chunk of Change EP, Frenchkiss, 2008\nPassion Pit, “Folds in Your Hands,” Manners, Frenchkiss, 2009\nPassion Pit, “Cry Like a Ghost,” Gossamer, Columbia, 2012\nPassion Pit, “I’ll Be Alright,” Gossamer, Columbia, 2012\nPassion Pit, “Sleepyhead,” (Live on Sound Opinions), Manners, Frenchkiss, 2009\nPassion Pit, “Carried Away,” Gossamer, Columbia, 2012\nWanda Jackson, “California Stars,” Unfinished Business, Sugar Hill Records, 2012\nWanda Jackson, “I’m Tore Down,” Unfinished Business, Sugar Hill Records, 2012\nX, “The New World,” More Fun in the New World, Elektra, 1983\nThe xx, “Fiction,” Coexist, Young Turks, 2012\nMumford & Suns, “Whispers in the Dark,” Babel, Island, 2012\nColdplay, “Every Teardrop is a Waterfall,” Mylo Xyloto, Parlophone, 2011\nMumford & Suns, “Holland Road,” Babel, Island, 2012\n\n\n\n\n","Audio":"http:\/\/audio.soundopinions.org\/streams\/2012\/10\/so_20121012.m3u\n","MainImage":"http:\/\/www.soundopinions.org\/images\/2012\/passionpit.jpg\n","FlickrPhotoSet":"","Videos":""},{"Date":"10.5.2012","Show":"Show 358","Description":"Jim and Greg are the Rock Doctors. They prescribe a musical remedy for a rock fan in need: this time it's acclaimed graphic novelist & comic book writer Mark Crilley in the waiting room.","Guests":"","ShowNotes":"1 It’s been a busy week for the pop charts. For 45 years, Elvis dominated the Billboard Top 100 with 108 career hits. This week Lil’ Wayne beat The King’s record with his 109th hit – a cameo in The Game’s “Celebration.” And with 600,000 in first week sales British folkies Mumford & Sons had the biggest opening of 2012 with Babel. They also beat Spotify’s streaming record, with 8 million listens in its first week. So much for the theory that streaming cannibalizes sales.\n\n2 After upsetting fans at New York’s Global Citizen Festival with the announcement that the band had no upcoming shows, Dave Grohl has finally put those Foo Fighter breakup fears to rest (or not?). In a letter on the band’s website, Grohl says the band is simply on hiatus. Jim says he wouldn’t mind if the hiatus were permanent.\n\n3a Those of you lucky enough to be able to work to music know that finding a perfect soundtrack isn't always easy. There's the matter of tempo, lyrics and beats. And for acclaimed comic book creator, children's book writer\/illustrator and graphic novelist Mark Crilley, the challenge is \"vibe.\" His latest series for Dark Horse is Brody's Ghost. It follows a serial killer hunter, and the material is much darker than his Akiko and Miki Falls series. Dark art calls for dark tunes, but Mark is a self-proclaimed musical \"softie.\" So he contacted the Rock Doctors to get a prescription for albums that are edgy, but still full of pop hooks and melody.\n\n3b Dr. Kot prescribed Stridulum II by Zola Jesus. The Wisconsin native combines an operatic voice and Gothic keyboards to create musical psychodramas. After taking his medicine for a week, Mark decides that a couple of the tracks will make his playlist, but for the most part this album was too dark. Dr. DeRogatis prescribed The Haunted Man by Bat for Lashes. This is Natasha Khan's third release, and Mark fell in love with moody lyrics and surprisingproduction. The Haunted Man worked like a miracle pill, and he'll be going back for this one while working on the 4th installment of Brody's Ghost. Look for it next spring.\n\n4 Mumford & Sons’ sophomore album Babel has done gangbusters on the album charts, but how will it fare on Sound Opinions’ Buy It, Burn It, Trash It scale? Mumford & Co. emerged from London’s thriving folk-rock scene in 2009 with a breakout album Sigh No More that landed them a slot performing with Bob Dylan at the Grammys. With their vests, beards, banjo, and dobro, the band sticks out in the mainstream rock scene, but as Greg explains, the difference is only skin deep. The boys’ folky instruments and wardrobe are just signifiers of folk. At its base Mumford & Sons are a sadly conventional arena rock band. Jim could not agree more. The band’s lyrics are vague and bland—the complete opposite of the biblical stories that they claim as inspiration. Babel gets a double Trash It.\n\n5 Next up is rapper Lupe Fiasco’s Food & Liquor II: The Great American Rap Album . It wasn’t too long ago in 2006 that Jim and Greg reviewed Lupe’s debut, the original Food & Liquor.\n It was a standout album in a wave of conscious hip-hop coming out of Chicago at the time. Now at age 30, Lupe is a veteran of the rap game. What does he have to offer on Food & Liquor II? According to Jim, plenty of food for thought. Lupe is rapping about issues like misogyny, economic exploitation of the poor, and native American rights that Jim says no one else in hip-hop is tackling. And if Lupe sometimes gets a little preachy, he also leavens his critiques with humor. Greg agrees, but he wishes the greatness of Lupe’s lyrics were matched by consistently great production. Despite those production flaws, Food & Liquor II gets a double Buy It.\n\n6 After Mumford & Sons, Jim was sorely in need of a folk-rock palette cleanser. So for his DIJ he chose one of the great folk rock musicians of all time, Richard Thompson. A founder of Fairport Convention, Thompson went on to make music with his wife, Linda Thompson, and as a solo artist. Like Marcus Mumford, Thompson has a yen for the biblical. But unlike Mumford, he used Bible stories to spine-tingling affect. Case in point, “The Calvary Cross,” a track he recorded with Linda on their 1974 album I Want to See the Bright Lights Tonight. Listen for the drums echoing Jesus’s footsteps as he climbs the hill where he will be crucified.","PullQuote":"","Recurringsegments":"Rock Doctors\nDIJ - Jim\n\nAfter Mumford & Sons, Jim was sorely in need of a folk-rock palette cleanser. So for his DIJ he chose one of the great folk rock musicians of all time, Richard Thompson. A founder of Fairport Convention, Thompson went on to make music with his wife, Linda Thompson, and as a solo artist. Like Marcus Mumford, Thompson has a yen for the biblical. But unlike Mumford, he used Bible stories to spine-tingling affect. Case in point, “The Calvary Cross,” a track he recorded with Linda on their 1974 album I Want to See the Bright Lights Tonight. Listen for the drums echoing Jesus’s footsteps as he climbs the hill where he will be crucified.","AlbumReviews":"Mumford & Sons - Babel\nLupe Fiasco - Food & Liquor II: The Great American Rap Album, Part 1","FeaturedSongs":"Game (feat. Chris Brown, Tyga, Wiz Khalifa & Lil Wayne), “Celebration,” Jesus Piece, Interscope. 2012\nFoo Fighters, “My Hero,” The Colour and the Shape, Capitol,1997\nPink Floyd, “Take Up Thy Stethoscope and Walk,” The Piperat the Gates of Dawn, Columbia, 1967\nThe Stooges, “Real Cool Time,” The Stooges, Elektra, 1969\nRufus Wainwright, “Cigarettes and Chocolate Milk,” Poses, DreamWorks, 2001\nBat for Lashes, “Glass,” Two Suns, Parlophone, 2009\nZola Jesus, “Vessel,” Conatus, Sacred Bones, 2011\nMichael Penn, “Seen the Doctor,” Free-For-All, RCA, 1992\nMudhoney, “Touch Me I’m Sick,” Superfuzz Bigmuff Plus Early Singles, Sub Pop, 1990\nZola Jesus, “I Can’t Stand,” Stridulum II, Souterrain Transmissions, 2010\nZola Jesus, “Sea Talk,” Stridulum II, Souterrain Transmissions, 2010\nBat for Lashes, “All Your Gold,” The Haunted Man, Parlophone, 2012\nBat for Lashes, “Laura,” The Haunted Man, Parlophone, 2012\nBat for Lashes, “Marilyn,” The Haunted Man, Parlophone, 2012\nAretha Franklin, “Dr. Feelgood (Love is a Serious Business),” I Never Loved a Man The Way I Love You, Atlantic, 1967\nMumford & Sons, “I Will Wait,” Babel, Island, 2012\nMumford & Sons, “Babel,” Babel, Island, 2012\nMumford & Sons, “Whispers in the Dark,” Babel, Island, 2012\nLupe Fiasco (feat. Casey Benjamin), “Strange Fruition,” Food & Liquor II: The Great American Rap Album Pt. I, Atlantic, 2012\nLupe Fiasco “Around My Way (Freedom Ain’t Free),” Food & Liquor II: The Great American Rap Album Pt. I, Atlantic, 2012\nRichard and Linda Thompson, “The Calvary Cross,” I Want to See the Bright Lights Tonight, Island, 1974\nTwo Fingers, “101 South,” Stunt Rhythms, Big Dada, 2012\nChromeo, “Call Me Up,” Fancy Footwork, Vice, 2007\nMeat Beat Manifesto, “God O.D. (Part 1),” Storm the Studio, Wax Trax!, 1989\nGenesis, “The Return of the Giant Hogweed,” Nursery Cryme, Charisma, 1971\nGreen Day, “Kill the DJ,” ¡Uno!, Reprise, 2012\nThe xx, “Sunset,” Coexist, Young Turks, 2012\n\n\n\n\n\n","Audio":"http:\/\/audio.soundopinions.org\/streams\/2012\/10\/so_20121005.m3u","MainImage":"http:\/\/www.soundopinions.org\/images\/rockdoctor.jpg","FlickrPhotoSet":"","Videos":""},{"Date":"9.28.2012","Show":"Show 357","Description":"Canadian garage rockers Japandroids join Jim and Greg onstage for a special taping of Sound Opinions Live at Chicago's Lincoln Hall.","Guests":"Japandroids","ShowNotes":"1 This week American and European regulators gave their official blessing to the merger of Universal Music Group and EMI. The big four major labels are now \ndown to three. So what could go wrong with one company controlling more than forty percent of the music market? According to Greg, a lot. Take a streaming service like Spotify: for Spotify to launch, the company had to obtain licensing deals for its music from the majors. With so much of the world’s music now in UMG’s hands, Greg predicts it’s going to be a lot tougher for tomorrow’s Spotifys and Pandoras to get into business. He sums it up: big tech and big labels 1, the little guy, 0.\n\n2 Are you one of the three remaining people on earth who haven’t seen Psy’s “Gangnam Style” video? Better get hip fast. The South Korean rapper just broke the Guinness Book of World Records’ entry for most YouTube likes (2.2 million). Back in June Sound Opinions prophesied that K-pop – Korean pop music – was poised to make a big splash in the States. But even Jim admits he never thought the genre’s breakout star would be a rotund rapper singing about a posh Seoul neighborhood.\n\n3 This summer three hundred fans joined Jim and Greg for a sold-out live taping of Sound Opinions at Chicago’s Lincoln Hall. The night’s special guests? Canadian garage rock duo Japandroids. Drummer David Prowse and guitarist Brian King were in a feisty mood, taking Jim to task for his characterization of their music as “wonderfully ugly.” “Is that a back-handed compliment?” Brian wanted to know. The two also performed tracks from their sophomore album, Celebration Rock (a Buy It for both Jim and Greg). Dave and Brian met as students in Victoria, British Columbia. (If you’re thinking of visiting, Brian recommends the Wax Museum’s “Chamber of Horrors.”) They launched Japandroids in 2006 and tried to make a go of it in the Vancouver music scene, already home to bands like Chet and Atlas Strategic. Despite the fact there’s only two of them, Japandroids make quite a roar, and they quickly made a name for themselves as an exhilarating live act. But they found frustratingly few venues to play in Vancouver. By the time Japandroids released their debut, Post-Nothing, in 2009, Dave tells Greg they thought it would be their farewell. That didn’t happen. Internet fate intervened, Post-Nothing blew up, and Brian and David embarked on a year and a half of touring. As its title suggests, Celebration Rock is really a party record. But Greg detects a note of melancholy amidst the boozing. Brian’s response: “If this is the last record we’re ever going to do, let’s make sure it’s the best record we’re ever going to do.”\n\n4 As a band Green Day is so firmly rooted in the adolescent mindset, it’s easy to forget how much history they have. As Jim points out, Green Day predates the nineties alternative era. They started out as an East Bay band riffing on the Ramones and playing VFW halls. Today they have a musical, American Idiot, and nine studio albums to their name. The ninth, ¡Uno! is just out. Billed as a “back to basics” record, Greg says ¡Uno! really samples from several of Green Day’s eras - from the teenage sneer of Dookie, to the “Time of Your Life” balladry of Nimrod. What’s missing on ¡Uno!, he says, is the ambition of the band’s later records, American Idiot and 21st Century Breakdown. For Greg, Green Day’s harkening back to its teenage self (particularly in its foul language on this record) feels like a step backward. He gives ¡Uno! a Trash It. Jim agrees ¡Uno! is a big disappointment. The only thing that saves it from the garbage heap is the great Dookie-era production of Rob Cavallo. Jim gives ¡Uno! a Burn It.\n\n5 Jim and Greg close out this week’s show with a review of the sophomore album by The xx. This trio of London art students enjoyed a rapid rise after the release of their self-titled debut. Not only did The xx win Britain’s Mercury Prize for the best record of 2009, they performed on Sound Opinions! The hype for their follow-up has been intense. Coexist debuted at No. 1 in the UK and No. 5 in the U.S. Jim says if you liked the first record, chances are you’ll like this one too. The band has talked in interviews about stripping back its already minimal sound, and Jim agrees. This is a spare, intimate bedroom recording. He gives The xx an A+ for sonic mood, but admits he didn’t find the tunes to be as memorable this go-round. He says Burn It. Greg disagrees. He thinks the interaction between Sim and Romy Croft’s vocals are the heart of this record, giving it a surprisingly soulful feel. The tunes are there, he says, for those who listen hard. He gives Coexist a Buy It.","PullQuote":"","Recurringsegments":"","AlbumReviews":"Green Day - ¡Uno!\nThe xx - Coexist","FeaturedSongs":"Sex Pistols, “EMI,” Never Mind the Bollocks, Here’s the Sex Pistols, Virgin, 1977\nPSY, “Gangnam Style,” Universal, 2012\nThe Japandroids, “The House That Heaven Built,” Celebration Rock, Polyvinyl Record Co., 2012\nAge of Electric, “Ugly,” Gods Teeth Ethel, 1993\nAtlas Strategic, “Smooth Nights,” That’s Familiar!, Self-released, 2002\nJapandroids, “Evil’s Sway” (Live on SO), Celebration Rock, Polyvinyl Record Co., 2012\nJapandroids, “For the Love of Ivy,” Celebration Rock, Polyvinyl Record Co., 2012\nJapandroids, “The House That Heaven Built,” Celebration Rock, Polyvinyl Record Co., 2012\nJapandroids, “Rockers East Vancouver,” Post-Nothing, Polyvinyl Record Co., 2009\nJapandroids, “The Nights of Wine and Roses,” Celebration Rock, Polyvinyl Record Co., 2012\nJapandroids, “Fire’s Highway” (Live on SO), Celebration Rock, Polyvinyl Record Co., 2012\nJapandroids, “Continuous Thunder,” Celebration Rock, Polyvinyl Record Co., 2012\nThe Replacements, “Can’t Hardly Wait,” Pleased to Meet Me, Sire, 1987\nJapandroids, “Younger Us” (Live on SO), Celebration Rock, Polyvinyl Record Co., 2012\nJapandroids, “Adrenaline Nightshift,” Celebration Rock, Polyvinyl Record Co., 2012\nGreen Day, “Oh Love,” ¡Uno!, Reprise, 2012\nGreen Day, “Kill the DJ,”¡Uno!, Reprise, 2012\nThe xx, “Angels,” Coexist, Young Turks, 2012\nThe xx, “Chained,” Coexist, Young Turks, 2012\nFlying Lotus, “Putty Boy Strut,” Until the Quiet Comes, Warp, 2012\nAstrud Gilberto and Stan Getz, “The Telephone Song,” Getz au Go Go, Verve, 1965\nEl-P, \"Request Denied,\" Cancer 4 Cure, Fat Possum, 2012\nThee Oh Sees, “Flood’s New Light,” Putrifiers II, In the Red, 2012","Audio":"http:\/\/audio.soundopinions.org\/streams\/2012\/09\/so_20120928.m3u","MainImage":"tp:\/\/www.soundopinions.org\/images\/2012\/japandroids.jpg","FlickrPhotoSet":"","Videos":""},{"Date":"9.21.2012","Show":"Show 356","Description":"Rapper, record mogul, and underground hip-hop producer El-P is live in the studio.","Guests":"El-P","ShowNotes":"1 This week, the BBC and British monitoring service Musicmetric released the most in-depth study yet of global file-sharing habits. The report confirms some common knowledge, but as Jim and Greg point out, it also contains a few surprises. We already knew the U.S. led the world in BitTorrent downloads, but who knew Drake was our most pirated artist? (Canadians seem to be returning the compliment - their most pirated artist is Kanye). The BBC’s city-by-city breakdown  of the U.K.’s most-pirated artists is even more intriguing. We should’ve known teen pop juggernaut Justin Bieber would claim a few towns (Oxfordshire and Great Yarmouth) but who knew Isle of Wight residents loved Louis Armstrong so much?\n\n2 El-P, aka Jaime Meline, joins Jim and Greg in the Sound Opinions studio this week. Take a look at any of the underground hip-hop that came out of New York in late ‘90s, and chances are you’ll find El-P somewhere in the background. As a rapper, producer, and head of the indie record label Definitive Jux, El-P has left an indelible mark on New York hip-hop. And he’s not slowing up anytime soon. This year, El-P produced Killer Mike’s R.A.P. Music and his own solo album, Cancer 4 Cure. El-P grew up in Brooklyn during hip-hop’s golden age in the eighties. By 1993 he’d founded his own group, Company Flow. He tells Jim and Greg how creating the track “Last Good Sleep,” for their sophomore album, Funcrusher Plus, transformed his approach to songwriting. The more specific and personal the story, El says, the more universal. Today, even El-P’s “political” songs are more about internal struggles than external ones. In fact the title for his record, Cancer 4 Cure, is inspired by the idea that our bodies are constantly fighting off an illness latent inside us. Not to suggest that Cancer 4 Cure is a downer. There’s hope, Jaime says, – though “not unbattered hope” – that the characters in his songs will come through.\n\n3 Jim and Greg wrap up the show with a review of Bob Dylan’s 35th studio album Tempest. After fifty years of recordings, do they even have to introduce the inimitable Robert Zimmerman? Tempest is Bob’s first album since 2009’s widely panned Christmas in the Heart, and it continues the trend of him producing his own albums. So what do we get on Tempest? Dylan’s voice, Greg notes, has always been unconventional, but fifty years has added considerable gravel and dirt to it. Nevertheless, it’s the voice, Greg says, the really carries this album. It’s perfect for the spur-of-the-moment, rough and rowdy honky-tonk feel Dylan is going for. Greg gives Tempest a Buy It. Jim agrees. Dylan has always been interested in pop culture figures – he’s sung about everyone from Rubin “Hurricane” Cater to Joe Gallo – so he wasn’t too surprised to hear a Leonardo DiCaprio cameo on Tempest’s title track. What can he say? Bob’s still got a sense of humor. Tempest gets a double Buy It.\n\n                                                                ","PullQuote":"","Recurringsegments":"","AlbumReviews":"Bob Dylan - Tempest","FeaturedSongs":"Ed Sheeran, \"U.n.i.,\" Ed Sheeran, Atlantic, 2011\nCompany Flow, \"Last Good Sleep,\" Funcrusher Plus, Rawkus, 1997\nRun D.M.C., \"Sucker M.C.'s,\" Run D.M.C., Arista, 1984\nEl-P, \"$4 Vic,\" (Live on Sound Opinions) Cancer 4 Cure, Fat Possum, 2012\nEl-P, \"For My Upstairs Neighbor,\" Cancer 4 Cure, Fat Possum, 2012\nCompany Flow, \"Bee Aware,\" Little Johnny From the Hospital, Rawkus, 2002\nCannibal Ox, \"Iron Galaxy,\" The Cold Vein, Definitive Jux, 2001\nEl-P, \"The Nang, The Front, The Bush And The Shit,\"\nEl-P, \"The Jig Is Up,\" (Live on Sound Opinions) Cancer 4 Cure, Fat Possum, 2012\nEl-P, \"Request Denied,\" Cancer 4 Cure, Fat Possum, 2012\nKiller Mike, “R.A.P. Music,” R.A.P. Music, Williams Street, 2012\nEl-P, \"Stay Down,\" (Live on Sound Opinions) Cancer 4 Cure, Fat Possum, 2012\nEl-P, \"Drones Over Brooklyn,\" Cancer 4 Cure, Fat Possum, 2012\nBob Dylan, \"Duquesne Whistle,\" Tempest, Columbia, 2012\nBob Dylan, \"Pay In Blood,\" Tempest, Columbia, 2012\nThe Drifters, “Answer the Phone,” I’ll Take You Where the Music’s Playing, Atlantic, 1965\nTallest Man On Earth, \"1904,\" There's No Leaving Now, Dead Oceans, 2012\nSummer Camp, \"Veronica Sawyer,\" Young EP, Moshi Moshi, 2010\nAnimals As Leaders, \"Waves of Babies,\" single, Prosthetic, 2010\nBob Mould, \"Star Machine,\" Silver Age, Merge, 2012","Audio":"http:\/\/audio.soundopinions.org\/streams\/2012\/09\/so_20120921.m3u","MainImage":"http:\/\/www.soundopinions.org\/images\/2012\/el-p.jpg","FlickrPhotoSet":"","Videos":""},{"Date":"9.14.2012","Show":"Show 355","Description":"Jim and Greg share some of their favorite music under the mainstream radar in the latest installment of Buried Treasures.","Guests":"","ShowNotes":"1 After three months of “Call Me Maybe” and “Somebody That I Used to Know” playing non-stop on commercial radio, Jim and Greg figure Sound Opinions listeners are due for an aural cleansing. This week, they dip into the wealth of great new music beyond the FM dial and play you some Buried Treasures. These artists might not be household names, but they’re definitely worth adding to your collection.\n\nGreg\nChromatics, Kill For Love\nTHEESatisfaction, awE NaturalE\nThe Very Best, MTMTMK\nScott Lucas and the Married Men, Blood Half Moon\n\nJim\nBassnectar, Vava Voom\nLester Bangs, Infinite Stretch\nThe Black Belles, The Black Belles\nDjango Django, Django Django\n\n2 Jim and Greg are generally dubious of supergroups. Too often they’re not the sum of their parts. But Off!’s visit last week had them feeling hopeful about the debut record from yet another indie supergroup, Divine Fits. Divine Fits is composed of songwriters Britt Daniel of Spoon, Dan Boeckner of Wolf Parade (and Handsome Furs, and drummer Sam Brown of New Bomb Turks. The combination of Daniel and Boeckner, Greg notes, is an interesting and potentially troublesome one. Whereas Daniel is cool and reserved, Boeckner is intense and in your face. So does A Thing Called Divine Fits live up to its lofty pedigree? Greg says it does. Daniel and Boeckner might bring different personalities to this partnership, but the two are kindred spirits when it comes to production style. Both embrace a minimalist, stripped-back approach to recording that Greg says makes listeners hyper-aware of musical details like the occasional castanet or maraca. He gives A Thing Called Divine Fits a Buy It. Jim can’t echo Greg’s enthusiasm. He says Divine Fits fails by abandoning the most successful elements of its members’ previous groups. Divine Fits has all the angularity of Spoon, for example, but none of its driving intensity. It has all Handsome Furs’ electronic edifice, \nwithout any of the sensuality that made that group compelling. Jim gives A Thing Called Divine Fits a Trash It.\n\n3 For his DIJ, Greg wants to celebrate the 20th anniversary of Los Lobos’s Kiko. In 1992, grunge acts like Nirvana were shaking up the mainstream, and veteran acts like Los Lobos had to either reinvent or face irrelevance. Kiko, Greg says, was Los Lobos’s answer to grunge’s challenge. The group started out in the seventies playing a fusion of American roots rock and Mexican folk. Kiko saw main songwriters David Hidalgo and Louie Perez moving in a more trippy psychedelic direction, writing lyrics that were so concise, they were almost haiku-like. The band’s new sound only really began to gel however when their label put them in the studio with producers Mitchell Froom and Tchad Blake. Froom and Blake pumped up the distortion and keyboard effects, and suddenly Los Lobos were walking into a new sonic world. Greg says the album’s opening track, “Dream in Blue,” represents the door opening onto that new world. Hidalgo and Perez’s lyrics describe a sleeping child who, as she begins to dream, finds herself entering a realm of unprecedented freedom.","PullQuote":"","Recurringsegments":"Buried Treasures\nDIJ - Greg\n\nFor his DIJ, Greg wants to celebrate the 20th anniversary of Los Lobos’s Kiko. In 1992, grunge acts like Nirvana were shaking up the mainstream, and veteran acts like Los Lobos had to either reinvent or face irrelevance. Kiko, Greg says, was Los Lobos’s answer to grunge’s challenge. The group started out in the seventies playing a fusion of American roots rock and Mexican folk. Kiko saw main songwriters David Hidalgo and Louie Perez moving in a more trippy psychedelic direction, writing lyrics that were so concise, they were almost haiku-like. The band’s new sound only really began to gel however when their label put them in the studio with producers Mitchell Froom and Tchad Blake. Froom and Blake pumped up the distortion and keyboard effects, and suddenly Los Lobos were walking into a new sonic world. Greg says the album’s opening track, “Dream in Blue,” represents the door opening onto that new world. Hidalgo and Perez’s lyrics describe a sleeping child who, as she begins to dream, finds herself entering a realm of unprecedented freedom.","AlbumReviews":"Divine Fits - A Thing Called Divine Fits","FeaturedSongs":"Chromatics, “Kill for Love,” Kill For Love, Italians Do It Better, 2012\nBassnectar, “Vava Voom,” Vava Voom, Amorphous Music, 2012\nTHEEsatisfaction, “QueenS,” AwE NaturalE, Sub Pop, 2012\nLester Bangs, “Almost,” Infinite Stetch, self-released, 2012\nDIIV, “(Druun),” Oshin, Captured Tracks, 2012\nThe Very Best, “Kondaine,” MTMTMK, Moshi Moshi\/Cooperative Music, 2012\nThe Very Best, “Adani,” MTMTMK, Moshi Moshi\/Cooperative Music, 2012\nThe Black Belles, “Howl at the Moon,” the Black Belles, Third Man Records, 2012\nScott Lucas & The Married Men, “Lover The Lullaby,” Blood Half Moon, The End Records, 2012\nDjango Django, “Default,” Django Django, Because Music, 2012\nThe Album Leaf, “Low Down,” Forward\/Return, self-released, 2012\nDivine Fits, “My Love Is Real,” A Thing Called Divine Fits, Merge, 2012\nDivine Fits, “Flaggin A Ride,” A Thing Called Divine Fits, Merge, 2012\nLos Lobos, “Dream in Blue,” Kiko, Slash\/WB, 1992\nElectric Light Orchestra, “Telephone Line,” A New World Record, Epic, 1976\nThe Pogues, “Tuesday Morning,” Waiting For Herb, Chamelion 1993\nThe Futureheads, “Thursday,” News and Tributes,  Vagrant, 2006\nDead Can Dance, “Anabasis,” Anastasis, PIAS, 2012\nApples in Stereo, “Can You Feel It?” New Magnetic Wonder, Yep Roc, 2007","Audio":"http:\/\/audio.soundopinions.org\/streams\/2012\/09\/so_20120914.m3u","MainImage":"http:\/\/www.soundopinions.org\/images\/treasures.jpg","FlickrPhotoSet":"","Videos":""},{"Date":"9.7.2012","Show":"Show 354","Description":"The punk supergroup Off! performs live in the studio.","Guests":"OFF!","ShowNotes":"1 Hal David – one half of the classic songwriting duo David and Bacharach – died last week at age 91. A lover of show tunes, he wrote nuanced, emotional lyrics in the sixties and seventies when rock n’ roll was ascendant. By retrofitting the Tin Pan Alley aesthetic for the rock generation, he became one of the most charting songwriters of the second half of the 20th century. Ever sung along to “What’s New Pussycat?” or “Raindrops Keep Fallin’ on My Head”? You have David to thank.  David and Bacharach’s most fruitful collaborationwas with Dionne Warwick. She started singing demos for them in the sixties. Frustrated that she never got to record their hits herself, she stormed out of the studio one day snapping “Don’t make me over!” a line that inspired David and Bacharach’s first hit song for her “Don’t Make Me Over” in 1963.\n\n2 We at Sound Opinions thought it wise to send a noise alert to our colleagues the day OFF! visited the studio. This punk supergroup doesn’t hold back, delivering minute long bursts of tightly structured punk anger. OFF! is the project of four veterans of the LA punk and hard rock scenes. They are Keith Morris of Black Flag and Circle Jerks fame, Dimitri Coats of Burning Brides, Steve McDonald, and Mario Rubalcaba of Rocket From the Crypt. Since getting together in 2009, the foursome has released two full-lengths: First Four EPs and this year’s official debut, OFF! Their sound harkens back to the heyday of LA hardcore, the genre Morris helped develop in the late seventies with Black Flag. But the band firmly rejects the hardcore label. Steve explains how the term came to be associated with violence and the boneheaded, testosterone-addled teens “who were the reason I got into punk in the first place.” So what does the band prefer to be called? “We’re a rock n’ roll band” says Morris. “Just crank it up.”\n\n3 And now for something completely different. Indie darling Chan Marshall, who goes by the stage name Cat Power, has a new album out called Sun. Sun is not what one generally associates with Cat Power. Over eight solo albums Marshall has developed a dusky, lonesome sound whose pure melancholy is often intensified in concert (she’s been known to curl up in a fetal ball onstage, so overcome with anxiety that she is unable to continue playing). Marshall wrote Sun as she was breaking up with her actor boyfriend Giovanni Ribisi, so one might ask, how sunny can Sun possibly be? Jim says it’s all relative, but he likes this album better than Marshall’s previous efforts. Instead of wallowing, Chan seems to be in self-help mode, reminding herself in “Ruin” that some people “don’t have s*** to eat.” And Jim likes that she’s traded in the dirgy guitar and piano for more upbeat synths on this record. He gives Sun a Burn It. Like Jim, Greg has found Marshall hard to take on previous albums, but he’s come to appreciate Sun. Chan, he says, is in a dancier mood here – she’s even got a fun little pop number in “3,6,9” – so he gives Sun a Buy it.\n\n4 Next Jim and Greg review the new solo album from an artist they affectionately call “Uncle Grumpy”: Bob Mould. If you were a music-loving kid coming up in the alternative ‘80s, Jim says, Mould’s band Hüsker Dü, was a revelation. The band imploded too early to cash in on the nineties alternative gravy train, so Mould founded another band, Sugar, in 1992. He also put out a prolific series of arty solo albums. Lately, Mould’s moved away from music to pursue writing. He published an autobiography See a Little Light last year (and discussed it on Sound Opinions). He says writing about his life inspired him to make Silver Age, a record he’s called dumb rock fun. Is that true? Jim says Uncle Grumpy’s just putting the critics off the scent. Like Mould’s book, this record is all about dark and light, highs and lows. It’s also got a wicked sense of humor. “Star Machine,” he says, is one of the most vicious eviscerations of the corporate rock machine he’s ever heard. Jim gives Silver Age a Buy It. Greg agrees. He says Mould can be a bit meticulous and fussy in his solo work, but here he’s letting it fly. Plus, he’s got Superchunk’s Jon Wurster playing drums on his record. So how could it be bad?","PullQuote":"","Recurringsegments":"","AlbumReviews":"Cat Power - Sun\nBob Mould - See a Little Light\n","FeaturedSongs":"Isaac Hayes, “Walk on By,” Hot buttered Soul, Enterprise, 1969\nDionne Warwick, “Don’t Make Me Over,” Presenting Dionne Warwick, Scepter, 1962\nOFF!, “Upside Down,” First Four EP’s, Vice,  2010\nCircle Jerks, “Red Tape,” Group Sex, Frontier, 1980\nOFF!, “Black Thoughts,” First Four EP’s, Vice,  2010\nThe Clash, “Tommy Gun,” Give ‘Em Enough Rope, CBS, 1978\nOFF!, “Borrow and Bomb (Live on Sound Opinions),” OFF!, Vice, 2012\nBlack Flag, “Nervous Breakdown,” Nervous Breakdown, SST, 1978\nOFF!, “I Got News For You,” OFF!, Vice, 2012\nOFF!, “Compared to What,” single, Vice, 2011\nOFF!, “Feeling are Meant to be,” OFF!, Vice, 2012\nOFF!, “Wrong,” OFF!, Vice, 2012\nStiff Little Fingers, “Suspect Device,” Inflammable Material, Rought Trade, 1979\nOFF!, “King Kong Brigade (Live on Sound Opinons),” OFF!, Vice, 2012\nD.O.A, “D.O.A.” Hardcore ’81, Sudden Death, 1981\nAngel, “Tower,” Angel, Casablanca\/Mercury, 1975\nThe Damned, “Born To Kill,” Damned Damned Damned, Stiff, 1977\nBlack Flag, “Rise Above,” Damaged, SST, 1981\nOFF!, “Elimination (Live on Sound Opinions),” OFF!, Vice, 2012\nOFF!, “Wiped Out,” OFF!, Vice, 2012\nOFF!, “Rotten Apple,” single, Vice, 2011\nCat Power, “Cherokee,” Sun, Matador, 2012\nCat Power, “Ruin,” Sun, Matador, 2012\nBob Mould, “Silver Age,” Silver Age, Merge 2012\nBob Mould, “Star Machine,” Silver Age, Merge 2012\nAretha Franklin, “Call ME,” This Girl’s In Love With You, Atlantic, 1970\nThe Ramones, “Let’s Dance,” Ramones, Sire, 1976\nThe Adverts, “One Chord Wonders,” Crossing the Red Sea with the Adverts, Bright, 1978\nSpanky and Our Gang, “Sunday Will Never Be the Same,” Spanky and Our Gang, Mercury, 1967\nDave Edmunds, “Here Comes the Weekend,” Get It, Swan Song Records, 1977","Audio":"http:\/\/audio.soundopinions.org\/streams\/2012\/09\/so_20120907.m3u","MainImage":"http:\/\/www.soundopinions.org\/images\/2012\/off.jpg","FlickrPhotoSet":"","Videos":""},{"Date":"8.31.2012","Show":"Show 353","Description":"Jim and Greg revisit their conversation with The Apples in Stereo’s Robert Schneider about the Elephant 6 Recording Collective. Plus, they review Anastasis, the new record from longtime 4AD band Dead Can Dance.","Guests":"","ShowNotes":"404 Error when I try to access the footnotes on the website","PullQuote":"","Recurringsegments":"DIJ: Jim\n\nJim’s been thinking a lot about Genesis lately – and no, not the most famous version of the band with Phil Collins on vocals. Before hits like “I Can’t Dance ” Genesis was an unabashedly nerdy prog rock band, and that’s the iteration of the group Jim wants to celebrate with his DIJ pick. 1971’s Nursery Cryme with Peter Gabriel on vocals fit wonderfully into Jim’s teenage world of renaissance fairs, Isaac Asimov, and Dungeons and Dragons. No track embodied the group’s proto-steampunk ethic better than “The Return of the Giant Hogweed.” Gabriel tells the story of a Victorian explorer who discovers the hogweed in Russia. Unaware of the plant’s carnivorous tendencies he brings it back to England to the royal Kew Gardens, where it proceeds to wreak havoc. Listen for Steve Hackett, mimicking the sounds of the murderous plant on his guitar.","AlbumReviews":"","FeaturedSongs":"404 Error when I try to access the footnotes","Audio":"http:\/\/audio.soundopinions.org\/streams\/2012\/08\/so_20120831.m3u","MainImage":"404 Error","FlickrPhotoSet":"","Videos":""},{"Date":"8.24.2012","Show":"Show 352","Description":"Jim and Greg celebrate the best Days of the Week songs.","Guests":"","ShowNotes":"1a The verdict is in: three members of the Russian punk band Pussy Riot have been found guilty of “hooliganism” and are sentenced to two years in prison. Pussy Riot caught international notice when they performed their “Punk Prayer” in Moscow’s foremost Orthodox Cathedral in February, calling upon the Virgin Mary to “banish Putin.” The Russian government responded with a Soviet-style show trial, making Pussy Riot the darlings of the West. Yoko Ono, Paul McCartney, and Madonna are just a sampling of the pop music illuminati who have publicly supported the group. Jim’s impressed that in 2012, punk music still has the power to seriously rile governments. To those who think rock music is just entertainment, he says, “think again.” Greg points out that Pussy Riot aren’t the first musical act to suffer serious consequences for politically charged music. They join a list that also includes Fela Kuti, Gilberto Gil, and The Plastic People of the Universe.\n\n1b In other news, the RIAA’s profits are way down according to their latest tax filings. Membership dues from the major labels fell 50% in two years, reflecting the hemorrhaging of the industry as a whole. Unsurprisingly, the RIAA’s executives are still doing just dandy. President Carey Sherman and VP Mitch Bainwol each pulled down million-plus salaries last year.\n\n2 To Jim and Greg, each day of the week has its own special flavor. Sensitive songwriters pick up on this; it’s one of the reasons rock n’ roll is rife with Days of the Week songs. This week, Jim and Greg run down their favorites:\n\nJoe Jackson, “Sunday Papers”\nT-Bone Walker, “Stormy Monday (But Tuesday is Just as Bad)”\nThe Rolling Stones, “Ruby Tuesday”\nCharles Mingus, “Wednesday Nigh Prayer Meeting”\nMorphine, “Thursday”\nCee Lo Green, “Bright Lights Bigger City”\nElton John, “Saturday Night’s Alright for Fighting”\nEtta James, “A Sunday Kind of Love”\n\n3 Jim and Greg review Fragrant World, the third album from Brooklyn band Yeasayer. Yeasayer started gaining buzz in the indie underground shortly after their 2007 debut, All Our Cymbals. Critics praised their inventive merging of shoegaze and world rhythms. Fans couldn’t get enough of the hooks. Fragrant World promised to be something a little different: band members said they were inspired by Aaliyah’s work with Missy Elliot. Fragrant World would be their take on R&B. Greg says the new album isn’t as immediately hooky as past efforts, but when it comes to taking R&B to an alien landscape, Yeasayer succeeds big time. It took him a road trip with the record to be won over, but now he says it reminds him of Bowie’s alien soul and funk in the seventies. Jim was a convert on first listen. The hooks are there, he says, but what really gets him is how the band downplays the novelty of their Eastern and African-tinged percussion, folding those drums seamlessly into electronic grooves. Fragrant World gets a double Buy It.","PullQuote":"","Recurringsegments":"","AlbumReviews":"Yeasayer - Fragrant World","FeaturedSongs":"Pussy Riot, “Punk Prayer“\nBikini Kill, “Rebel Girl,” Yeah Yeah Yeah Yeah, Kill Rock Stars, 1992\nFela Kuti, “Zombie”, Zombie, Knitting Factory Records, 1977\nLeonard Cohen, “Everybody Knows,” I’m Your Man, Columbia, 1988\nThe Easybeats, “Friday On My Mind”, Friday on My Mind (Single), United Artists, 1966\nJoe Jackson, “Sunday Papers,” Look Sharp!, A&M, 1978\nT-Bone Walker, “Stormy Monday (But Tuesday is Just as Bad),” Stormy Monday (But Tuesday is Just as Bad) (Single), Black & White, 1947\nFrank Sinatra, “Sunday, Monday or Always,” Sunday, Monday or Always (Single), Columbia, 1943\nThe Beatles, “Eight Days A Week,” Beatles for Sale, Parlophone, 1964\nThe Rolling Stones, “Ruby Tuesday,” Between the Buttons, Decca, 1967\nCharles Mingus, “Wednesday Night Prayer Meeting,” Me, Myself an Eye, Atlantic, 1979\nMorphine, “Thursday,” Cure for Pain, Rykodisc, 1993\nCee Lo Green, “Bright Lights Bigger City,” The Lady Killer, Elektra, 2010\nCure, “Friday I’m In Love”, Wish, Elektra, 1992\nLoverboy, “Working For The Weekend,” Get Lucky, Columbia, 1981\nElton John, “Saturday Night’s Alright For Fighting” Goodbye Yellow Brick Road, MCA. 1973\nEtta James, “A Sunday Kind of Love,” At Last!, Argo, 1961\nYeasayer, “Folk Hero Schtick,” Fragrant World, Secretly Canadian, 2012\nYeasayer, “Henrietta,” Fragrant World, Secretly Canadian, 2012\nJim Croce, “Operator,” Don’t Mess Around With Jim, ABC, 1972\nInsane Clown Posse, “Boogie Woogie Wu”, The Great Milenko, Island, 1997\nThe Stranglers, “No More Heroes, “ No More Heroes, United Artists, 1977\nThe Dead Kennedys, “California Uber Alles,” Fresh Fruit For Rotting Vegetables, Optional Music, 1979\nPassion Pit, “I’ll Be Alright” Gossamer, Columbia, 2012","Audio":"http:\/\/audio.soundopinions.org\/streams\/2012\/08\/so_20120824.m3u","MainImage":"http:\/\/www.soundopinions.org\/images\/2012\/daysoftheweek.jpg","FlickrPhotoSet":"","Videos":""},{"Date":"8.17.2012","Show":"Show 351","Description":"In part two of our series 1977: The Year Punk Broke, Jim and Greg look at the punk movement stateside with music writer Ira Robbins. ","Guests":"","ShowNotes":"1a So you think you know how kids are consuming music these days? Think again. Media information company Nielsen just released a report that debunks many of the myths surrounding kids and music, the biggest of which is that they just don’t buy it anymore. Teens, it turns out, consume more music than any other age group. And though YouTube has edged out radio as their primary means of discovering new music, over a third of teens bought an old-fashioned CD in the past year. What’s most surprising? Only 17 percent of teens say they download music illegally.\n\n1b The Juggalos are fighting back! Last year the FBI placed the Juggalos – superfans of Detroit’s horrorcore rap duo Insane Clown Posse – on its National Gang Threat Assessment list. At last weekend’s gathering of the Juggalos, Violent J and Shaggy 2 Dope announced they weren’t taking the gang label (or accusations of petty theft and violence) lying down. They’ve set up a website, juggalosfightback.com, where fans can submit complaints of discrimination based on their “gang” affiliation in preparation for what could be a class action lawsuit against the FBI. The incident reminds Jim of the FBI’s similarly misguided “investigation” into the content of The Kingsmen’s 1957 hit “Louie Louie.” He thinks maybe it’s time the Feds turned off their radios and retired from cultural criticism.\n\n2 In the second and final installment of our series 1977: The Year Punk Broke, Jim and Greg explore the punk movement stateside with music writer Ira Robbins. Ira founded the music magazine Trouser Press in 1974. As a music journalist in New York, he was a fixture of the CBGBs scene, regularly “taking [his] life in his hands” to go to second avenue and hear bands like the Ramones, the Dictators, the Dead Boys, and Television play divey clubs. Whereas punk enjoyed a rapid rise in the U.K. in 1977, Ira describes the New York scene as more of a slow simmer. Fans gradually migrated from clubs like Max’s Kansas City, where glam acts like The New York Dolls ruled, to clubs like CBGBs where a younger, rawer set of performers was defining the punk look and sound. Though the Ramones, with their simple song structures and leather jackets became emblematic of New York punk, Ira remembers a diverse scene. The Dead Boys, Television, and The Talking Heads may not have sounded the same, but in economically-depressed 70s-era New York, they shared an attitude that “life sucked, it’s probably not going to get better, but so what.”\n\nJim and Greg each choose a favorite track from the New York scene. Greg goes with the Talking Heads’ “Don’t Worry About the Government” from the band’s self-titled debut. More than any other band, the Talking Heads epitomized New York punk’s diversity. Their first gig may have been opening for the Ramones, but Greg contends the band’s sound was more dance than punk. Still, Byrne’s narrator in this song – a stressed, neurotic government bureaucrat – taps into the anxiety of the punk era. Jims goes with the ultimate American punk anthem, Richard Hell’s “Blank Generation.” The story goes that U.K. punk impresario Malcolm McLaren saw Hell perform the song in the U.S., then returned home and advised The Sex Pistols to write something “just like it, but your own.”\n\n3 Jim and Greg close out the show by reviewing the new, self-titled album from Brooklyn afrobeat band Antibalas. This is the fifth studio album from a group whose sound is largely the product of one man – Nigerian saxophone player and afrobeat inventor Fela Kuti. Kuti forged afrobeat from American jazz, African highlife, and tribal music, infusing the mix with potent political commentary. Antibalas are devotees of Fela, and recently played in and arranged the music for Fela! on Broadway. Jim’s verdict: if you don’t get an itch to start dancing listening to this music, you don’t have a pulse. Antibalas aren’t slaves to Fela’s legacy. They too are political, but they’re singing about modern day issues like the economy and immigration. Greg also observes that unlike the autocratic Fela, Antibalas is a democracy. There are some fine solos on this record, but what’s really thrilling is how the band works together. Antibalas gets a double Buy It.","PullQuote":"","Recurringsegments":"","AlbumReviews":"Antibalas - Antibalas","FeaturedSongs":"Elvis Costello and The Attractions, “Radio Radio,” This Year’s Model, Radar, 1978\nInsane Clown Posse, “Boogie Woogie Wu,” The Great Milenko, Hollywood\/Psychopathic, 1997\nThe Kingsmen, “Louie,Louie,” The Kingsmen in Person, Wand, 1963\nRamones, “Cretin Hop,” Rocket to Russia, Sire, 1977\nThe Heartbreakers, “Born Too Loose,” L.A.M.F., Track, 1977\nNew York Dolls, “Personality Crisis,” New York Dolls, Mercury, 1973\nTelevision, “Prove It,” Marquee Moon, Elektra, 1977\nRamones, “Sheena is a Punk Rocker,” Rocket to Russia, Sire, 1977\nThe Dictators, “Teengenerate,” Go Girl Crazy!, Epic, 1975\nRamones, “Pinhead,” Leave Home, Sire, 1977\nTelevision, “Friction,” Marquee Moon, Elektra, 1977\nTelevision, “Venus de Milo” Double Exposure, unofficial release, 1992\nTelevision, “Venus,” Marquee Moon, Elektra, 1977\nThe Heartbreakers, “Chinese Rocks,” L.A.M.F., Track, 1977\nSuicide, “Ghost Rider,” Suicide, Red Star, 1977\nThe Dead Boys, “Sonic Reducer,” Young Loud and Snotty, Sire, 1977\nJames Chance, “Dish It Out,” No New York, Antilles, 1978\nTelevision, “Marquee Moon,” Marquee Moon, Elektra, 1977\nTalking Heads, “Don’t Worry About the Government,” Talking Heads: 77, Sire, 1977\nRichard Hell and The Voidoids, “Blank Generation,” Blank Generation, Sire, 1977\nRichard Hell and The Voidoids, “Down at the Rock and Roll Club,” Blank Generation, Sire, 1977\nAntibalas, “The Rat Catcher,” Antibalas, Daptones, 2012\nAntibalas, “Dirty Money,” Antiabalas, Daptones, 2012\nLukid, “Snow Theme,” Lonely at the Top, Werk Discs, 2012\nSuper Furry Animals, “Wherever I Lay My Phone (That’s My Home),” Guerilla, Creation, 1999\nWire, “Ambitious,” The Ideal Copy, Mute, 1987\nThe Wasps, “Can’t Wait Till 78,” Live at the Vortex, NEMS, 1977\nSex Pistols, “ Problems,” Never Mind the Bollocks, Here’s the Sex Pistols, Warner Bros., 1977\nThe Afghan Whigs, “Gentlemen,” Gentlemen, Elektra, 1993\nWhy?, “The Vowels, Pt. 2,” Alopecia, Anticon, 2008","Audio":"http:\/\/audio.soundopinions.org\/streams\/2012\/08\/so_20120817.m3u","MainImage":"http:\/\/www.soundopinions.org\/images\/2012\/1977_part2.jpg","FlickrPhotoSet":"","Videos":""}]